GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_system.c
/* CPU2 reserves the first 16 bytes of SRAM2A for Hardfault
   and security attack magic values. AN5289 4.8.2
*/

#define STM32WB_SYSTEM_REFERENCE_RANGE_1_2      \
    (STM32WB_SYSTEM_REFERENCE_HSI48 |           \
     STM32WB_SYSTEM_REFERENCE_WIRELESS |        \
     STM32WB_SYSTEM_REFERENCE_USB |             \
     STM32WB_SYSTEM_REFERENCE_RNG |             \
     STM32WB_SYSTEM_REFERENCE_SYSCLK_RANGE_1 |  \
     STM32WB_SYSTEM_REFERENCE_SYSCLK_RANGE_2 |  \
     STM32WB_SYSTEM_REFERENCE_SAICLK_RANGE_1 |  \
     STM32WB_SYSTEM_REFERENCE_SAICLK_RANGE_2)

#define STM32WB_SYSTEM_REFERENCE_RANGE_1        \
    (STM32WB_SYSTEM_REFERENCE_HSI48 |           \
     STM32WB_SYSTEM_REFERENCE_WIRELESS |        \
     STM32WB_SYSTEM_REFERENCE_USB |             \
     STM32WB_SYSTEM_REFERENCE_RNG |             \
     STM32WB_SYSTEM_REFERENCE_SYSCLK_RANGE_1 |  \
     STM32WB_SYSTEM_REFERENCE_SAICLK_RANGE_1)

extern uint8_t __Vectors[];
extern uint8_t __StackTop[];

extern uint8_t __ccvectors_start__[];
extern uint8_t __ccvectors_end__[];
extern uint8_t __cctext_start__[];
extern uint8_t __cctext_end__[];
extern uint8_t __cctext_flash__[];
extern uint8_t __ccram_start__[];
extern uint8_t __ccram_end__[];

extern uint8_t __ipcc_start__[];
extern uint8_t __ipcc_end__[];
extern uint8_t __data2_start__[];
extern uint8_t __data2_end__[];
extern uint8_t __data2_flash__[];
extern uint8_t __bss2_start__[];
extern uint8_t __bss2_end__[];

typedef struct _stm32wb_system_device_t {
    uint32_t                        options;
    uint32_t                        lseclk;
    uint32_t                        hseclk;
    uint32_t                        sysclk;
    uint32_t                        hclk;
    uint32_t                        pclk1;
    uint32_t                        pclk2;
    uint32_t                        saiclk; 
    uint8_t                         mco;
    uint8_t                         lsco;
    uint8_t                         hse;
    uint8_t                         lsi;
    uint8_t                         msi;
    uint8_t                         hsi16;
    uint8_t                         clk48;
    uint8_t                         pllsys;
    uint8_t                         latency;
    uint8_t                         smps;
    uint8_t                         palevel;
    uint32_t                        msirange;
    uint32_t                        c2hpre;
    uint32_t                        hsecalib;
    stm32wb_system_pvm1_callback_t  pvm1_callback;
    void                            *pvm1_context;
    stm32wb_system_notify_t         *notify;
    volatile uint8_t                lock[STM32WB_SYSTEM_LOCK_COUNT];
    volatile uint32_t               reference;
    volatile uint32_t               events;
} stm32wb_system_device_t;

static stm32wb_system_device_t stm32wb_system_device;

static volatile uint32_t * const stm32wb_system_xlate_RSTR[STM32WB_SYSTEM_PERIPH_COUNT] = {
    &RCC->AHB2RSTR,           /* STM32WB_SYSTEM_PERIPH_ADC */
    &RCC->APB1RSTR1,          /* STM32WB_SYSTEM_PERIPH_USB */
    &RCC->APB2RSTR,           /* STM32WB_SYSTEM_PERIPH_USART1 */
    &RCC->APB1RSTR2,          /* STM32WB_SYSTEM_PERIPH_LPUART1 */
    &RCC->APB1RSTR1,          /* STM32WB_SYSTEM_PERIPH_I2C1 */
    &RCC->APB1RSTR1,          /* STM32WB_SYSTEM_PERIPH_I2C3 */
    &RCC->APB2RSTR,           /* STM32WB_SYSTEM_PERIPH_SPI1 */
    &RCC->APB1RSTR1,          /* STM32WB_SYSTEM_PERIPH_SPI2 */
    &RCC->AHB3RSTR,           /* STM32WB_SYSTEM_PERIPH_QSPI */
    &RCC->APB2RSTR,           /* STM32WB_SYSTEM_PERIPH_SAI1 */
    &RCC->APB2RSTR,           /* STM32WB_SYSTEM_PERIPH_TIM1 */
    &RCC->APB1RSTR1,          /* STM32WB_SYSTEM_PERIPH_TIM2 */
    &RCC->APB2RSTR,           /* STM32WB_SYSTEM_PERIPH_TIM16 */
    &RCC->APB2RSTR,           /* STM32WB_SYSTEM_PERIPH_TIM17 */
    &RCC->APB1RSTR1,          /* STM32WB_SYSTEM_PERIPH_LPTIM1 */
    &RCC->APB1RSTR2,          /* STM32WB_SYSTEM_PERIPH_LPTIM2 */
    &RCC->AHB1RSTR,           /* STM32WB_SYSTEM_PERIPH_TSC */
    &RCC->APB1RSTR1,          /* STM32WB_SYSTEM_PERIPH_LCD */
    &RCC->AHB3RSTR,           /* STM32WB_SYSTEM_PERIPH_HSEM */
    &RCC->AHB3RSTR,           /* STM32WB_SYSTEM_PERIPH_IPCC */
    &RCC->AHB1RSTR,           /* STM32WB_SYSTEM_PERIPH_CRC */
    &RCC->AHB3RSTR,           /* STM32WB_SYSTEM_PERIPH_RNG */
    &RCC->AHB2RSTR,           /* STM32WB_SYSTEM_PERIPH_AES1 */
    &RCC->AHB3RSTR,           /* STM32WB_SYSTEM_PERIPH_AES2 */
    &RCC->AHB3RSTR,           /* STM32WB_SYSTEM_PERIPH_PKA */
};

static uint32_t const stm32wb_system_xlate_RSTMSK[STM32WB_SYSTEM_PERIPH_COUNT] = {
    RCC_AHB2RSTR_ADCRST,      /* STM32WB_SYSTEM_PERIPH_ADC */
    RCC_APB1RSTR1_USBRST,     /* STM32WB_SYSTEM_PERIPH_USB */
    RCC_APB2RSTR_USART1RST,   /* STM32WB_SYSTEM_PERIPH_USART1 */
    RCC_APB1RSTR2_LPUART1RST, /* STM32WB_SYSTEM_PERIPH_LPUART1 */
    RCC_APB1RSTR1_I2C1RST,    /* STM32WB_SYSTEM_PERIPH_I2C1 */
    RCC_APB1RSTR1_I2C3RST,    /* STM32WB_SYSTEM_PERIPH_I2C3 */
    RCC_APB2RSTR_SPI1RST,     /* STM32WB_SYSTEM_PERIPH_SPI1 */
    RCC_APB1RSTR1_SPI2RST,    /* STM32WB_SYSTEM_PERIPH_SPI2 */
    RCC_AHB3RSTR_QUADSPIRST,  /* STM32WB_SYSTEM_PERIPH_QSPI */
    RCC_APB2RSTR_SAI1RST,     /* STM32WB_SYSTEM_PERIPH_SAI1 */
    RCC_APB2RSTR_TIM1RST,     /* STM32WB_SYSTEM_PERIPH_TIM1 */
    RCC_APB1RSTR1_TIM2RST,    /* STM32WB_SYSTEM_PERIPH_TIM2 */
    RCC_APB2RSTR_TIM16RST,    /* STM32WB_SYSTEM_PERIPH_TIM16 */
    RCC_APB2RSTR_TIM17RST,    /* STM32WB_SYSTEM_PERIPH_TIM17 */
    RCC_APB1RSTR1_LPTIM1RST,  /* STM32WB_SYSTEM_PERIPH_LPTIM1 */
    RCC_APB1RSTR2_LPTIM2RST,  /* STM32WB_SYSTEM_PERIPH_LPTIM2 */
    RCC_AHB1RSTR_TSCRST,      /* STM32WB_SYSTEM_PERIPH_TSC */
    RCC_APB1RSTR1_LCDRST,     /* STM32WB_SYSTEM_PERIPH_LCD */
    RCC_AHB3RSTR_HSEMRST,     /* STM32WB_SYSTEM_PERIPH_HSEM */
    RCC_AHB3RSTR_IPCCRST,     /* STM32WB_SYSTEM_PERIPH_IPCC */
    RCC_AHB1RSTR_CRCRST,      /* STM32WB_SYSTEM_PERIPH_CRC */
    RCC_AHB3RSTR_RNGRST,      /* STM32WB_SYSTEM_PERIPH_RNG */
    RCC_AHB2RSTR_AES1RST,     /* STM32WB_SYSTEM_PERIPH_AES1 */
    RCC_AHB3RSTR_AES2RST,     /* STM32WB_SYSTEM_PERIPH_AES2 */
    RCC_AHB3RSTR_PKARST,      /* STM32WB_SYSTEM_PERIPH_PKA */
};

