GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_system.c
static volatile uint32_t * const stm32wb_system_xlate_ENR[STM32WB_SYSTEM_PERIPH_COUNT] = {
    &RCC->AHB2ENR,            /* STM32WB_SYSTEM_PERIPH_ADC */
    &RCC->APB1ENR1,           /* STM32WB_SYSTEM_PERIPH_USB */
    &RCC->APB2ENR,            /* STM32WB_SYSTEM_PERIPH_USART1 */
    &RCC->APB1ENR2,           /* STM32WB_SYSTEM_PERIPH_LPUART1 */
    &RCC->APB1ENR1,           /* STM32WB_SYSTEM_PERIPH_I2C1 */
    &RCC->APB1ENR1,           /* STM32WB_SYSTEM_PERIPH_I2C3 */
    &RCC->APB2ENR,            /* STM32WB_SYSTEM_PERIPH_SPI1 */
    &RCC->APB1ENR1,           /* STM32WB_SYSTEM_PERIPH_SPI2 */
    &RCC->AHB3ENR,            /* STM32WB_SYSTEM_PERIPH_QSPI */
    &RCC->APB2ENR,            /* STM32WB_SYSTEM_PERIPH_SAI1 */
    &RCC->APB2ENR,            /* STM32WB_SYSTEM_PERIPH_TIM1 */
    &RCC->APB1ENR1,           /* STM32WB_SYSTEM_PERIPH_TIM2 */
    &RCC->APB2ENR,            /* STM32WB_SYSTEM_PERIPH_TIM16 */
    &RCC->APB2ENR,            /* STM32WB_SYSTEM_PERIPH_TIM17 */
    &RCC->APB1ENR1,           /* STM32WB_SYSTEM_PERIPH_LPTIM1 */
    &RCC->APB1ENR2,           /* STM32WB_SYSTEM_PERIPH_LPTIM2 */
    &RCC->AHB1ENR,            /* STM32WB_SYSTEM_PERIPH_TSC */
    &RCC->APB1ENR1,           /* STM32WB_SYSTEM_PERIPH_LCD */
    &RCC->AHB3ENR,            /* STM32WB_SYSTEM_PERIPH_HSEM */
    &RCC->AHB3ENR,            /* STM32WB_SYSTEM_PERIPH_IPCC */
    &RCC->AHB1ENR,            /* STM32WB_SYSTEM_PERIPH_CRC */
    &RCC->AHB3ENR,            /* STM32WB_SYSTEM_PERIPH_RNG */
    &RCC->AHB2ENR,            /* STM32WB_SYSTEM_PERIPH_AES1 */
    &RCC->AHB3ENR,            /* STM32WB_SYSTEM_PERIPH_AES2 */
    &RCC->AHB3ENR,            /* STM32WB_SYSTEM_PERIPH_PKA */
};

static uint32_t const stm32wb_system_xlate_ENMSK[STM32WB_SYSTEM_PERIPH_COUNT] = {
    RCC_AHB2ENR_ADCEN,        /* STM32WB_SYSTEM_PERIPH_ADC */
    RCC_APB1ENR1_USBEN,       /* STM32WB_SYSTEM_PERIPH_USB */
    RCC_APB2ENR_USART1EN,     /* STM32WB_SYSTEM_PERIPH_USART1 */
    RCC_APB1ENR2_LPUART1EN,   /* STM32WB_SYSTEM_PERIPH_LPUART1 */
    RCC_APB1ENR1_I2C1EN,      /* STM32WB_SYSTEM_PERIPH_I2C1 */
    RCC_APB1ENR1_I2C3EN,      /* STM32WB_SYSTEM_PERIPH_I2C3 */
    RCC_APB2ENR_SPI1EN,       /* STM32WB_SYSTEM_PERIPH_SPI1 */
    RCC_APB1ENR1_SPI2EN,      /* STM32WB_SYSTEM_PERIPH_SPI2 */
    RCC_AHB3ENR_QUADSPIEN,    /* STM32WB_SYSTEM_PERIPH_QSPI */
    RCC_APB2ENR_SAI1EN,       /* STM32WB_SYSTEM_PERIPH_SAI1 */
    RCC_APB2ENR_TIM1EN,       /* STM32WB_SYSTEM_PERIPH_TIM1 */
    RCC_APB1ENR1_TIM2EN,      /* STM32WB_SYSTEM_PERIPH_TIM2 */
    RCC_APB2ENR_TIM16EN,      /* STM32WB_SYSTEM_PERIPH_TIM16 */
    RCC_APB2ENR_TIM17EN,      /* STM32WB_SYSTEM_PERIPH_TIM17 */
    RCC_APB1ENR1_LPTIM1EN,    /* STM32WB_SYSTEM_PERIPH_LPTIM1 */
    RCC_APB1ENR2_LPTIM2EN,    /* STM32WB_SYSTEM_PERIPH_LPTIM2 */
    RCC_AHB1ENR_TSCEN,        /* STM32WB_SYSTEM_PERIPH_TSC */
    RCC_APB1ENR1_LCDEN,       /* STM32WB_SYSTEM_PERIPH_LCD */
    RCC_AHB3ENR_HSEMEN,       /* STM32WB_SYSTEM_PERIPH_HSEM */
    RCC_AHB3ENR_IPCCEN,       /* STM32WB_SYSTEM_PERIPH_IPCC */
    RCC_AHB1ENR_CRCEN,        /* STM32WB_SYSTEM_PERIPH_CRC */
    RCC_AHB3ENR_RNGEN,        /* STM32WB_SYSTEM_PERIPH_RNG */
    RCC_AHB2ENR_AES1EN,       /* STM32WB_SYSTEM_PERIPH_AES1 */
    RCC_AHB3ENR_AES2EN,       /* STM32WB_SYSTEM_PERIPH_AES2 */
    RCC_AHB3ENR_PKAEN,        /* STM32WB_SYSTEM_PERIPH_PKA */
};

static uint16_t __SECTION_NOINIT __stm32wb_system_reset;
static uint16_t __SECTION_NOINIT __stm32wb_system_wakeup;

uint32_t __SECTION_NOINIT SystemCoreClock;

void SystemInit(void)
{
    uint32_t flash_acr;
    volatile uint32_t *ccvectors, *ccvectors_e, *cctext, *cctext_e;
    const uint32_t *ccvectors_f, *cctext_f;
    
    RCC->CIER = 0x00000000;

    RCC->APB1ENR1 |= RCC_APB1ENR1_RTCAPBEN;

    /* Switch to Main Flash @ 0x00000000. Make sure the I/D CACHE is
     * disabled to avoid stale data in the cache.
     */

    flash_acr = FLASH->ACR;

    FLASH->ACR = flash_acr & ~(FLASH_ACR_ICEN | FLASH_ACR_DCEN);
        
    SYSCFG->MEMRMP = 0;

    PWR->CR1 |= PWR_CR1_DBP;
    
    while (!(PWR->CR1 & PWR_CR1_DBP))
    {
    }
    
    if (RCC->BDCR & RCC_BDCR_RTCEN)
    {
        if ((((RTC->BKP16R & STM32WB_RTC_BKP16R_DATA_MASK) >> STM32WB_RTC_BKP16R_DATA_SHIFT) != ((~RTC->BKP16R & STM32WB_RTC_BKP16R_NOT_DATA_MASK) >> STM32WB_RTC_BKP16R_NOT_DATA_SHIFT)) ||
            ((RTC->BKP16R & STM32WB_RTC_BKP16R_REVISION_MASK) != STM32WB_RTC_BKP16R_REVISION_CURRENT))
        {
            /* Reset RTC after a BKP mismatch, but also go throu a CPU reset to start off clean.
             */
            RCC->BDCR &= ~RCC_BDCR_RTCEN;
            RCC->BDCR |= RCC_BDCR_BDRST;
            RCC->BDCR &= ~RCC_BDCR_BDRST;

            NVIC_SystemReset();
            
            while (1)
            {
            }
        }
    }

    if (PWR->EXTSCR & PWR_EXTSCR_C1SBF)
    {
        __stm32wb_system_reset = STM32WB_SYSTEM_RESET_STANDBY;
        __stm32wb_system_wakeup = (PWR->SR1 & PWR_SR1_WUF);
        
        if (RCC->CSR & (RCC_CSR_IWDGRSTF | RCC_CSR_WWDGRSTF))
        {
            __stm32wb_system_wakeup |= STM32WB_SYSTEM_WAKEUP_WATCHDOG;
        }
        
        if (RCC->CSR & (RCC_CSR_BORRSTF | RCC_CSR_PINRSTF))
        {
            __stm32wb_system_wakeup |= STM32WB_SYSTEM_WAKEUP_RESET;
        }
        
        if (RCC->BDCR & RCC_BDCR_RTCEN)
        {
            __stm32wb_system_wakeup = stm32wb_rtc_standby_leave(__stm32wb_system_wakeup);
        }

        if (!__stm32wb_system_wakeup)
        {
            SCB->SCR |= SCB_SCR_SLEEPDEEP_Msk;
            __DSB();

            __SEV();
            __WFE();
            __WFE();
    
            while (1)
            {
            }
        }
    }
    else
    {
        /* The STM32 BOOTLOADER does not do a reset when jumping to the newly flashed
         * code. Hence CPU2 might be booted. If so, do a software reset.
         */
        if (PWR->CR4 & PWR_CR4_C2BOOT)
        {
            NVIC_SystemReset();
            
            while (1)
            {
            }
        }

        __stm32wb_system_reset = STM32WB_SYSTEM_RESET_PIN;
        __stm32wb_system_wakeup = STM32WB_SYSTEM_WAKEUP_NONE;

        if (RCC->CSR & RCC_CSR_SFTRSTF)
        {
            __stm32wb_system_reset = STM32WB_SYSTEM_RESET_SOFTWARE;

