GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_system.c
            if (RCC->BDCR & RCC_BDCR_RTCEN)
            {
                if (RTC->BKP16R & STM32WB_RTC_BKP16R_FATAL)
                {
                    __stm32wb_system_reset = STM32WB_SYSTEM_RESET_FATAL;
                }
                else if (RTC->BKP16R & STM32WB_RTC_BKP16R_DFU)
                {
                    __stm32wb_system_reset = STM32WB_SYSTEM_RESET_DFU;
                }
                else if (RTC->BKP16R & STM32WB_RTC_BKP16R_OTA)
                {
                    __stm32wb_system_reset = STM32WB_SYSTEM_RESET_OTA;
                }
            }
        }
        else
        {
            if (RCC->CSR & (RCC_CSR_IWDGRSTF | RCC_CSR_WWDGRSTF))
            {
                __stm32wb_system_reset = STM32WB_SYSTEM_RESET_WATCHDOG;
            }
            
            else if (RCC->CSR & (RCC_CSR_LPWRRSTF | RCC_CSR_OBLRSTF))
            {
                __stm32wb_system_reset = STM32WB_SYSTEM_RESET_INTERNAL;
            }
            
            else if (RCC->CSR & RCC_CSR_BORRSTF)
            {
                __stm32wb_system_reset = STM32WB_SYSTEM_RESET_POWERON;
            }
        }
    }
    
    RCC->CSR |= RCC_CSR_RMVF;
    RCC->CSR &= ~RCC_CSR_RMVF;

    PWR->SCR = (PWR_SCR_CWUF5 | PWR_SCR_CWUF4 | PWR_SCR_CWUF3 | PWR_SCR_CWUF2 | PWR_SCR_CWUF1);
    PWR->EXTSCR = PWR_EXTSCR_C1CSSF;

    if (__stm32wb_system_reset != STM32WB_SYSTEM_RESET_FATAL)
    {
        armv7m_core_fatal_info.signature = 0x00000000;
    }
    
    /****************************************************************************************************************************************************************/
    
    if (__stm32wb_system_reset == STM32WB_SYSTEM_RESET_DFU)
    {
        RTC->WPR = 0xca;
        RTC->WPR = 0x53;

        RTC->BKP16R = (RTC->BKP16R & ~STM32WB_RTC_BKP16R_DFU) | (STM32WB_RTC_BKP16R_DFU << STM32WB_RTC_BKP16R_NOT_DATA_SHIFT);
    
        RTC->WPR = 0x00;
                
        SYSCFG->MEMRMP = SYSCFG_MEMRMP_MEM_MODE_0;
        
        FLASH->ACR = (flash_acr & ~(FLASH_ACR_ICEN | FLASH_ACR_DCEN)) | (FLASH_ACR_ICRST | FLASH_ACR_DCRST);
        FLASH->ACR = flash_acr;
        
        RCC->AHB2ENR |= (RCC_AHB2ENR_GPIOAEN | RCC_AHB2ENR_GPIOBEN | RCC_AHB2ENR_GPIOCEN); 
        
        /* Allow only USB/DFU and USART1 (PA9/PA10/PA11/PA12) */
        GPIOA->LCKR = 0x0001e1ff;
        GPIOA->LCKR = 0x0000e1ff;
        GPIOA->LCKR = 0x0001e1ff;
        GPIOA->LCKR;
        GPIOB->LCKR = 0x0001ffff;
        GPIOB->LCKR = 0x0000ffff;
        GPIOB->LCKR = 0x0001ffff;
        GPIOB->LCKR;
        GPIOC->LCKR = 0x00011fff;
        GPIOC->LCKR = 0x00001fff;
        GPIOC->LCKR = 0x00011fff;
        GPIOC->LCKR;
        
        RCC->AHB2ENR &= ~(RCC_AHB2ENR_GPIOAEN | RCC_AHB2ENR_GPIOBEN | RCC_AHB2ENR_GPIOCEN); 
        
        RCC->APB1ENR1 &= ~RCC_APB1ENR1_RTCAPBEN;
        
        /* This needs to be assembly code as GCC catches NULL 
         * dereferences ...
         */
        __asm__ volatile ("   mov     r2, #0       \n"
                          "   ldr     r0, [r2, #0] \n"
                          "   ldr     r1, [r2, #4] \n"
                          "   msr     MSP, r0      \n"
                          "   dsb                  \n"
                          "   isb                  \n"
                          "   bx      r1           \n");
    }
    
    /* We should be at a 4MHz MSI clock, so switch to HSI16 for the
     * init code to be half way fast.
     */

    FLASH->ACR = (flash_acr & ~(FLASH_ACR_ICEN | FLASH_ACR_DCEN)) | (FLASH_ACR_ICRST | FLASH_ACR_DCRST);
    FLASH->ACR = FLASH_ACR_ICEN | FLASH_ACR_DCEN | FLASH_ACR_LATENCY_0WS;
    
    if (!(RCC->CR & RCC_CR_HSION))
    {
        RCC->CR |= RCC_CR_HSION;
        
        while (!(RCC->CR & RCC_CR_HSIRDY))
        {
        }
    }

    if ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_HSI)
    {
        RCC->CFGR = (RCC->CFGR & ~RCC_CFGR_SW) | RCC_CFGR_SW_HSI;
            
        while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_HSI)
        {
        }
    }

    SystemCoreClock = 16000000;

    ccvectors = (uint32_t*)&__ccvectors_start__[0];
    ccvectors_e = (uint32_t*)&__ccvectors_end__[0];
    ccvectors_f = (const uint32_t*)&__Vectors;
    
    do
    {
        *ccvectors++ = *ccvectors_f++;
    }
    while (ccvectors != ccvectors_e);
    
    if (&__cctext_start__[0] != &__cctext_end__[0])
    {
        cctext = (uint32_t*)&__cctext_start__[0];
        cctext_e = (uint32_t*)&__cctext_end__[0];
        cctext_f = (const uint32_t*)&__cctext_flash__[0];
        
        do
        {
            *cctext++ = *cctext_f++;
        }
        while (cctext != cctext_e);
    }

    /* Write protect .ccram in SRAM2b */
    SYSCFG->SWPR2 = (0xffffffff >> (32 - (((uint32_t)__ccram_end__ - (uint32_t)__ccram_start__ + 1023) / 1024))) << (((uint32_t)__ccram_start__ - SRAM2B_BASE + 1023) / 1024);
    
    SCB->VTOR = (uint32_t)&__ccvectors_start__[0];
    __DSB();

    __armv7m_core_initialize();
}

void stm32wb_system_initialize(uint32_t sysclk, uint32_t hclk, uint32_t pclk1, uint32_t pclk2, uint32_t lseclk, uint32_t hseclk, uint32_t options)
{
    uint32_t count;
    volatile uint32_t *ipcc, *ipcc_e, *data2, *data2_e, *bss2, *bss2_e;
    const uint32_t *data2_f;

    __disable_irq();

    if (RCC->BDCR & RCC_BDCR_RTCEN)
    {
        if (!(RCC->BDCR & RCC_BDCR_LSEON))
        {
            lseclk = 0;
        }

        if (!(RTC->BKP17R & STM32WB_RTC_BKP17R_HSECLK))
        {
            hseclk = 0;
        }
    }
    else
    {
        if (lseclk)
        {
            if (options & STM32WB_SYSTEM_OPTION_LSE_BYPASS)
            {
                RCC->BDCR |= RCC_BDCR_LSEBYP;
            }
            else
            {
                if (!(RCC->BDCR & RCC_BDCR_LSEON))
                {
                    /* Add LSEDRV before turning on LSE.
                     */
                    RCC->BDCR |= (((options & STM32WB_SYSTEM_OPTION_LSE_MODE_MASK) >> STM32WB_SYSTEM_OPTION_LSE_MODE_SHIFT) << RCC_BDCR_LSEDRV_Pos);

                    RCC->BDCR |= RCC_BDCR_LSEON;

                    /* The loop below take about 8 cycles per iteration. The startup time for
                     * LSE is 5000ms. At 16MHz this corresponds to about 10000000 iterations.
                     */
                    count = 0;
                
                    while (!(RCC->BDCR & RCC_BDCR_LSERDY))
                    {
                        if (++count >= 10000000)
                        {
                            lseclk = 0;
                        
