GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_system.c
                            RCC->BDCR &= ~RCC_BDCR_LSEON;

                            break;
                        }
                    }
                }
            }
        }

        if (hseclk)
        {
            if (!(options & STM32WB_SYSTEM_OPTION_HSE_BYPASS))
            {
                RCC->CR |= RCC_CR_HSEON;
                
                /* The loop below take about 8 cycles per iteration. The startup time for
                 * HSE is 100ms. At 16MHz this corresponds to about 200000 iterations.
                 */
                count = 0;
                
                while (!(RCC->CR & RCC_CR_HSERDY))
                {
                    if (++count >= 200000)
                    {
                        hseclk = 0;
                        break;
                    }
                }
            }
        }

        if (lseclk && hseclk)
        {
            uint32_t hsecalib, tc0, tc1;
        
            hsecalib = 0;

            RCC->CR |= RCC_CR_HSEPRE;

            RCC->CFGR = (RCC->CFGR & ~RCC_CFGR_SW) | RCC_CFGR_SW_HSE;
                
            while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_HSE)
            {
            }
            
            RCC->APB2ENR |= RCC_APB2ENR_TIM16EN;
            RCC->APB2ENR;

            TIM16->CR1  = TIM_CR1_URS;
            TIM16->CR2  = 0;
            TIM16->DIER = 0;
            TIM16->PSC  = 0;
            TIM16->ARR  = 0xffff;
            TIM16->OR   = TIM16_OR_TI1_RMP_1; /* Select LSE as TI1 */
            TIM16->EGR  = TIM_EGR_UG;
            TIM16->CR1  |= TIM_CR1_CEN;

            TIM16->CCER  = 0;
            TIM16->CCMR1 = TIM_CCMR1_CC1S_0 | TIM_CCMR1_IC1PSC_1 | TIM_CCMR1_IC1PSC_0; /* Count every 8th pulse */
            TIM16->CCER  = TIM_CCER_CC1E;

            TIM16->SR = 0;
        
            while (!(TIM16->SR & TIM_SR_CC1IF))
            {
            }
            
            TIM16->SR = 0;

            tc0 = TIM16->CCR1;

            for (count = 0; count < (1024 / 8); count++)
            {
                while (!(TIM16->SR & TIM_SR_CC1IF))
                {
                }

                TIM16->SR = 0;

                tc1 = TIM16->CCR1;

                if (tc1 < tc0)
                {
                    hsecalib += ((65536 + tc1) - tc0);
                }
                else
                {
                    hsecalib += (tc1 - tc0);
                }

                tc0 = tc1;
            }
        
            RCC->APB2ENR &= ~RCC_APB2ENR_TIM16EN;
            RCC->APB2ENR;

            RCC->CFGR = (RCC->CFGR & ~RCC_CFGR_SW) | RCC_CFGR_SW_HSI;
                
            while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_HSI)
            {
            }

            RCC->CR &= ~RCC_CR_HSEPRE;

            stm32wb_system_device.hsecalib = hsecalib * 64;
        }
    
        RCC->CR &= ~RCC_CR_HSEON;
    }

    if (lseclk)
    {
        RCC->CSR = (RCC->CSR & ~(RCC_CSR_RFWKPSEL | RCC_CSR_LSI1ON)) | (RCC_CSR_RFWKPSEL_0);
    }
    else
    {
        RCC->CSR = (RCC->CSR & ~(RCC_CSR_RFWKPSEL | RCC_CSR_LSI1ON)) | (RCC_CSR_LSI1ON | RCC_CSR_RFWKPSEL_0 | RCC_CSR_RFWKPSEL_1);
        
        while (!(RCC->CSR & RCC_CSR_LSI1RDY))
        {
        }
        
        stm32wb_system_device.lsi = 0x80;
    }
    
    if (options & STM32WB_SYSTEM_OPTION_VBAT_CHARGING)
    {
        PWR->CR4 |= PWR_CR4_VBE;
    }

    /* Keep SRAM2a alive in STANDBY */
    PWR->CR3 |= PWR_CR3_RRS;

    if (__stm32wb_system_reset != STM32WB_SYSTEM_RESET_STANDBY)
    {
        /* Punt CPU2 all the way to SHUTDOWN.
         */
        PWR->C2CR1 = (PWR->C2CR1 & ~PWR_C2CR1_LPMS) | PWR_C2CR1_LPMS_SHUTDOWN;

        if (&__ipcc_start__[0] != &__ipcc_end__[0])
        {
            ipcc = (uint32_t*)&__ipcc_start__[0];
            ipcc_e = (uint32_t*)&__ipcc_end__[0];

            do
            {
                *ipcc++ = 0x00000000;
            }
            while (ipcc != ipcc_e);
        }

        if (&__data2_start__[0] != &__data2_end__[0])
        {
            data2 = (uint32_t*)&__data2_start__[0];
            data2_e = (uint32_t*)&__data2_end__[0];
            data2_f = (const uint32_t*)&__data2_flash__[0];

            do
            {
                *data2++ = *data2_f++;
            }
            while (data2 != data2_e);
        }

        if (&__bss2_start__[0] != &__bss2_end__[0])
        {
            bss2 = (uint32_t*)&__bss2_start__[0];
            bss2_e = (uint32_t*)&__bss2_end__[0];

            do
            {
                *bss2++ = 0x00000000;
            }
            while (bss2 != bss2_e);
        }
    }
    
    /* Disable SMPS for now ... */
    PWR->CR5 &= ~(PWR_CR5_SMPSEN | PWR_CR5_BORHC);
    
    if (options & (STM32WB_SYSTEM_OPTION_SMPS_INDUCTOR_10uH | STM32WB_SYSTEM_OPTION_SMPS_INDUCTOR_2_2uH))
    {
        RCC->SMPSCR = (RCC->SMPSCR & ~RCC_SMPSCR_SMPSDIV) | ((options & STM32WB_SYSTEM_OPTION_SMPS_INDUCTOR_10uH) ? RCC_SMPSCR_SMPSDIV_0 : 0);

        PWR->CR5 = (PWR->CR5 & ~PWR_CR5_SMPSSC) | (((options & STM32WB_SYSTEM_OPTION_SMPS_CURRENT_MASK) >> STM32WB_SYSTEM_OPTION_SMPS_CURRENT_SHIFT) << PWR_CR5_SMPSSC_Pos);
    }
    
    /* Setup default SLEEP mode settings */
    RCC->AHB1SMENR  = (RCC_AHB1SMENR_DMA1SMEN |
                       RCC_AHB1SMENR_DMA2SMEN |
                       RCC_AHB1SMENR_DMAMUX1SMEN |
                       RCC_AHB1SMENR_CRCSMEN |
                       RCC_AHB1SMENR_TSCSMEN);

    RCC->AHB2SMENR  = (RCC_AHB2SMENR_ADCSMEN |
                       RCC_AHB2SMENR_AES1SMEN);

    RCC->AHB3SMENR  = (RCC_AHB3SMENR_QUADSPISMEN |
                       RCC_AHB3SMENR_PKASMEN |
                       RCC_AHB3SMENR_AES2SMEN |
                       RCC_AHB3SMENR_RNGSMEN);
    
    RCC->APB1SMENR1 = (RCC_APB1SMENR1_TIM2SMEN |
                       RCC_APB1SMENR1_LCDSMEN |
                       RCC_APB1SMENR1_SPI2SMEN |
                       RCC_APB1SMENR1_I2C1SMEN |
                       RCC_APB1SMENR1_I2C3SMEN |
                       RCC_APB1SMENR1_CRSSMEN |
                       RCC_APB1SMENR1_USBSMEN |
                       RCC_APB1SMENR1_LPTIM1SMEN);
                       
    RCC->APB1SMENR2 = (RCC_APB1SMENR2_LPUART1SMEN |
                       RCC_APB1SMENR2_LPTIM2SMEN);

    RCC->APB2SMENR  = (RCC_APB2SMENR_TIM1SMEN |
                       RCC_APB2SMENR_SPI1SMEN |
                       RCC_APB2SMENR_USART1SMEN |
                       RCC_APB2SMENR_TIM16SMEN |
                       RCC_APB2SMENR_TIM17SMEN |
                       RCC_APB2SMENR_SAI1SMEN);
    
    /* Setup the independent clocks for the peripherals to HSI16, except
     * LUPART which is LSE. CLK48 is driven by HSI48 with CRS.
     */
    RCC->CCIPR = ((0 |                                               /* RNG is CLK48           */
                   RCC_CCIPR_ADCSEL_1 | RCC_CCIPR_ADCSEL_0 |         /* ADC is SYSCLK          */
                   0 |                                               /* CLK48 is HSI48         */
                   0 |                                               /* SAI1SEL is PLLSAI1 "P" */
                   RCC_CCIPR_LPTIM2SEL_1 |                           /* LPTIM2 is HSI16        */
                   RCC_CCIPR_I2C3SEL_1 |                             /* I2C3 is HSI16          */
                   RCC_CCIPR_I2C1SEL_1 |                             /* I2C1 is HSI16          */
                   RCC_CCIPR_LPUART1SEL_1) |                         /* LPUART1 is HSI16       */
                  ((options & STM32WB_SYSTEM_OPTION_USART1_SYSCLK)
                   ? (RCC_CCIPR_USART1SEL_0)                         /* USART1 is SYSCLK       */
                   : (RCC_CCIPR_USART1SEL_1)) |                      /* USART1 is HSI16        */
                  (lseclk
                   ? (RCC_CCIPR_LPTIM1SEL_1 | RCC_CCIPR_LPTIM1SEL_0) /* LPTIM1 is LSE          */
                   : (RCC_CCIPR_LPTIM1SEL_0)));                      /* LPTIM1 is LSI          */


