GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_system.c
#if 0    
    EXTI->IMR2 |= EXTI_IMR2_IM48;
    EXTI->C2IMR2 |= EXTI_C2IMR2_IM48;
#endif
    
    EXTI->IMR2 &= ~EXTI_IMR2_IM48;
    EXTI->C2IMR2 &= ~EXTI_C2IMR2_IM48;
    
    stm32wb_system_device.reference = 0;
    stm32wb_system_device.options = options;
    stm32wb_system_device.lseclk = lseclk;
    stm32wb_system_device.hseclk = hseclk;
    
    if (CoreDebug->DHCSR & CoreDebug_DHCSR_C_DEBUGEN_Msk)
    {
        DBGMCU->CR       = DBGMCU_CR_DBG_SLEEP | DBGMCU_CR_DBG_STOP | DBGMCU_CR_DBG_STANDBY;
        DBGMCU->APB1FZR1 = (DBGMCU_APB1FZR1_DBG_RTC_STOP |
                            DBGMCU_APB1FZR1_DBG_IWDG_STOP |
                            DBGMCU_APB1FZR1_DBG_I2C1_STOP |
                            DBGMCU_APB1FZR1_DBG_I2C3_STOP |
                            DBGMCU_APB1FZR1_DBG_LPTIM1_STOP);
        DBGMCU->APB1FZR2 = (DBGMCU_APB1FZR2_DBG_LPTIM2_STOP);
        DBGMCU->APB2FZR  = 0;

        // RTT in SRAM2
        RCC->AHB3SMENR |= RCC_AHB3SMENR_SRAM2SMEN;

#if 0        
        EXTI->IMR2 |= EXTI_IMR2_IM48;
        EXTI->C2IMR2 |= EXTI_C2IMR2_IM48;
#endif
        
        stm32wb_system_device.reference |= STM32WB_SYSTEM_REFERENCE_SWD;
    }
         
    NVIC_SetPriority(PVD_PVM_IRQn, STM32WB_PVD_PVM_IRQ_PRIORITY);
    NVIC_EnableIRQ(PVD_PVM_IRQn);
    
    __stm32wb_hsem_initialize();
    __stm32wb_gpio_initialize();
    __stm32wb_exti_initialize();
    __stm32wb_dma_initialize();
    __stm32wb_rtc_initialize();
    __stm32wb_lptim_initialize();
    __stm32wb_ipcc_initialize();
    
    __enable_irq();
    
    stm32wb_system_sysclk_configure(sysclk, hclk, pclk1, pclk2);

    __stm32wb_flash_initialize();
    __stm32wb_eeprom_initialize();
    __stm32wb_random_initialize();
}

static void stm32wb_system_sysclk_ext_compute(uint32_t sysclk, uint32_t hclk, uint32_t *p_latency_return, uint32_t *p_c2hpre_return, uint32_t *p_shdhpre_return)
{
    uint32_t hclk2, hclk4, latency, c2hpre, shdhpre;

    if      (stm32wb_system_device.reference & STM32WB_SYSTEM_REFERENCE_WIRELESS) { hclk2 = 32000000; }
    else if (stm32wb_system_device.reference & STM32WB_SYSTEM_REFERENCE_CPU2)     { hclk2 = 16000000; }
    else                                                                          { hclk2 =  2000000; }

    if      (hclk2 >= (sysclk / 1))   { hclk2 = sysclk / 1;   c2hpre = RCC_EXTCFGR_C2HPRE_DIV1;   }
    else if (hclk2 >= (sysclk / 2))   { hclk2 = sysclk / 2;   c2hpre = RCC_EXTCFGR_C2HPRE_DIV2;   }
    else if (hclk2 >= (sysclk / 4))   { hclk2 = sysclk / 4;   c2hpre = RCC_EXTCFGR_C2HPRE_DIV4;   }
    else if (hclk2 >= (sysclk / 8))   { hclk2 = sysclk / 8;   c2hpre = RCC_EXTCFGR_C2HPRE_DIV8;   }
    else if (hclk2 >= (sysclk / 16))  { hclk2 = sysclk / 16;  c2hpre = RCC_EXTCFGR_C2HPRE_DIV16;  }
    else if (hclk2 >= (sysclk / 32))  { hclk2 = sysclk / 32;  c2hpre = RCC_EXTCFGR_C2HPRE_DIV32;  }
    else if (hclk2 >= (sysclk / 64))  { hclk2 = sysclk / 64;  c2hpre = RCC_EXTCFGR_C2HPRE_DIV64;  }
    else if (hclk2 >= (sysclk / 128)) { hclk2 = sysclk / 128; c2hpre = RCC_EXTCFGR_C2HPRE_DIV128; }
    else if (hclk2 >= (sysclk / 256)) { hclk2 = sysclk / 256; c2hpre = RCC_EXTCFGR_C2HPRE_DIV256; }
    else                              { hclk2 = sysclk / 512; c2hpre = RCC_EXTCFGR_C2HPRE_DIV512; }

    hclk4 = (hclk >= hclk2) ? hclk : hclk2;

    if      (hclk4 >= (sysclk / 1))   { hclk4 = sysclk / 1;   shdhpre = RCC_EXTCFGR_SHDHPRE_DIV1;   }
    else if (hclk4 >= (sysclk / 2))   { hclk4 = sysclk / 2;   shdhpre = RCC_EXTCFGR_SHDHPRE_DIV2;   }
    else if (hclk4 >= (sysclk / 4))   { hclk4 = sysclk / 4;   shdhpre = RCC_EXTCFGR_SHDHPRE_DIV4;   }
    else if (hclk4 >= (sysclk / 8))   { hclk4 = sysclk / 8;   shdhpre = RCC_EXTCFGR_SHDHPRE_DIV8;   }
    else if (hclk4 >= (sysclk / 16))  { hclk4 = sysclk / 16;  shdhpre = RCC_EXTCFGR_SHDHPRE_DIV16;  }
    else if (hclk4 >= (sysclk / 32))  { hclk4 = sysclk / 32;  shdhpre = RCC_EXTCFGR_SHDHPRE_DIV32;  }
    else if (hclk4 >= (sysclk / 64))  { hclk4 = sysclk / 64;  shdhpre = RCC_EXTCFGR_SHDHPRE_DIV64;  }
    else if (hclk4 >= (sysclk / 128)) { hclk4 = sysclk / 128; shdhpre = RCC_EXTCFGR_SHDHPRE_DIV128; }
    else if (hclk4 >= (sysclk / 256)) { hclk4 = sysclk / 256; shdhpre = RCC_EXTCFGR_SHDHPRE_DIV256; }
    else                              { hclk4 = sysclk / 512; shdhpre = RCC_EXTCFGR_SHDHPRE_DIV512; }
    
    if (hclk4 <= 16000000)
    {
        if      (hclk4 <=  60000000) { latency = FLASH_ACR_LATENCY_0WS; }
        else if (hclk4 <= 120000000) { latency = FLASH_ACR_LATENCY_1WS; }
        else                         { latency = FLASH_ACR_LATENCY_2WS; }
    } 
    else
    {
        if      (hclk4 <=  16000000) { latency = FLASH_ACR_LATENCY_0WS; }
        else if (hclk4 <=  32000000) { latency = FLASH_ACR_LATENCY_1WS; }
        else if (hclk4 <=  48000000) { latency = FLASH_ACR_LATENCY_2WS; }
        else                         { latency = FLASH_ACR_LATENCY_3WS; }
    }

    *p_latency_return = latency;
    *p_c2hpre_return  = c2hpre;
    *p_shdhpre_return = shdhpre;
}

static void stm32wb_system_sysclk_ext_configure(uint32_t sysclk, uint32_t hclk)
{
    uint32_t latency, c2hpre, shdhpre;
    
    stm32wb_system_sysclk_ext_compute(sysclk, hclk, &latency, &c2hpre, &shdhpre);
    
    while (!stm32wb_hsem_trylock(STM32WB_HSEM_INDEX_FLASH, STM32WB_HSEM_PROCID_NONE))
    {
    }
    
    FLASH->ACR = FLASH_ACR_ICEN | FLASH_ACR_DCEN | FLASH_ACR_LATENCY_3WS;
   
    stm32wb_hsem_unlock(STM32WB_HSEM_INDEX_FLASH, STM32WB_HSEM_PROCID_NONE);
    
    while (!stm32wb_hsem_trylock(STM32WB_HSEM_INDEX_RCC, STM32WB_HSEM_PROCID_NONE))
    {
    }
    
    RCC->EXTCFGR = (RCC->EXTCFGR & ~(RCC_EXTCFGR_SHDHPRE | RCC_EXTCFGR_C2HPRE | RCC_EXTCFGR_SHDHPREF | RCC_EXTCFGR_C2HPREF)) | shdhpre | c2hpre;
    
    while ((RCC->EXTCFGR & (RCC_EXTCFGR_SHDHPREF | RCC_EXTCFGR_C2HPREF)) != (RCC_EXTCFGR_SHDHPREF | RCC_EXTCFGR_C2HPREF))
    {
    }
    
    stm32wb_hsem_unlock(STM32WB_HSEM_INDEX_RCC, STM32WB_HSEM_PROCID_NONE);
    
    while (!stm32wb_hsem_trylock(STM32WB_HSEM_INDEX_FLASH, STM32WB_HSEM_PROCID_NONE))
    {
    }
    
    FLASH->ACR = FLASH_ACR_ICEN | FLASH_ACR_DCEN | latency;
    
    stm32wb_hsem_unlock(STM32WB_HSEM_INDEX_FLASH, STM32WB_HSEM_PROCID_NONE);

    stm32wb_system_device.latency = latency;
    stm32wb_system_device.c2hpre = c2hpre;
}

static bool __svc_stm32wb_system_sysclk_configure(uint32_t sysclk, uint32_t hclk, uint32_t pclk1, uint32_t pclk2)
{
    uint32_t tclk, primask, pllcfg, msirange, hpre, ppre1, ppre2, c2hpre, shdhpre, latency, smpsvos;
    bool hse, pllsys, smps;

    if (!sysclk)
    {
        sysclk = hclk;
    }
    
    if (stm32wb_system_device.reference & STM32WB_SYSTEM_REFERENCE_WIRELESS)
    {
        /* Use HSE */

        hse = true;
        
