GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_system.c
        if (sysclk >= 64000000)
        {
            sysclk = tclk = 64000000;
            tclk = 2 * stm32wb_system_device.hsecalib;
            
            msirange = RCC_CR_MSIRANGE_8;

            pllcfg = ((1 << RCC_PLLCFGR_PLLR_Pos) | (64000000 / (4000000 / 2)) << RCC_PLLCFGR_PLLN_Pos) | (((8-1) << RCC_PLLCFGR_PLLM_Pos) | RCC_PLLCFGR_PLLREN | RCC_PLLCFGR_PLLSRC_HSE);

            pllsys = true;
        }
        else
        {
            sysclk = tclk = 32000000;
            tclk = stm32wb_system_device.hsecalib;

            msirange = RCC_CR_MSIRANGE_10;
            
            pllcfg = (((8-1) << RCC_PLLCFGR_PLLM_Pos) | RCC_PLLCFGR_PLLSRC_HSE);
            
            pllsys = false;
        }
    }
    else
    {
        /* Use MSI */

        hse = false;

        if (sysclk >= 64000000)
        {
            sysclk = 64000000;
            tclk = 4 * (488 * 32768);
            
            msirange = RCC_CR_MSIRANGE_8;
                
            pllcfg = ((1 << RCC_PLLCFGR_PLLR_Pos) | (64000000 / (4000000 / 2)) << RCC_PLLCFGR_PLLN_Pos) | (((4-1) << RCC_PLLCFGR_PLLM_Pos) | RCC_PLLCFGR_PLLREN | RCC_PLLCFGR_PLLSRC_MSI);

            pllsys = true;
        }
        else
        {
            if      (sysclk >= 32000000) { sysclk = 32000000; tclk = 977 * 32768; msirange = RCC_CR_MSIRANGE_10; pllcfg = (((8-1) << RCC_PLLCFGR_PLLM_Pos) | RCC_PLLCFGR_PLLSRC_MSI); }
            else if (sysclk >= 16000000) { sysclk = 16000000; tclk = 488 * 32768; msirange = RCC_CR_MSIRANGE_8;  pllcfg = (((4-1) << RCC_PLLCFGR_PLLM_Pos) | RCC_PLLCFGR_PLLSRC_MSI); }
            else                         { sysclk =  2000000; tclk =  61 * 32768; msirange = RCC_CR_MSIRANGE_5;  pllcfg = RCC_PLLCFGR_PLLSRC_NONE;                                    }
            
            pllsys = false;
        }
    }
    
    if      (hclk >= (sysclk / 1))   { hclk = sysclk / 1;   tclk = tclk / 1;   hpre = RCC_CFGR_HPRE_DIV1;   }
    else if (hclk >= (sysclk / 2))   { hclk = sysclk / 2;   tclk = tclk / 2;   hpre = RCC_CFGR_HPRE_DIV2;   }
    else if (hclk >= (sysclk / 4))   { hclk = sysclk / 4;   tclk = tclk / 4;   hpre = RCC_CFGR_HPRE_DIV4;   }
    else if (hclk >= (sysclk / 8))   { hclk = sysclk / 8;   tclk = tclk / 8;   hpre = RCC_CFGR_HPRE_DIV8;   }
    else if (hclk >= (sysclk / 16))  { hclk = sysclk / 16;  tclk = tclk / 16;  hpre = RCC_CFGR_HPRE_DIV16;  }
    else if (hclk >= (sysclk / 32))  { hclk = sysclk / 32;  tclk = tclk / 32;  hpre = RCC_CFGR_HPRE_DIV32;  }
    else if (hclk >= (sysclk / 64))  { hclk = sysclk / 64;  tclk = tclk / 64;  hpre = RCC_CFGR_HPRE_DIV64;  }
    else if (hclk >= (sysclk / 128)) { hclk = sysclk / 128; tclk = tclk / 128; hpre = RCC_CFGR_HPRE_DIV128; }
    else if (hclk >= (sysclk / 256)) { hclk = sysclk / 256; tclk = tclk / 256; hpre = RCC_CFGR_HPRE_DIV256; }
    else                             { hclk = sysclk / 512; tclk = tclk / 512; hpre = RCC_CFGR_HPRE_DIV512; }
    
    if (pclk1)
    {
        if      (pclk1 >= (hclk / 1)) { pclk1 = hclk / 1;  ppre1 = RCC_CFGR_PPRE1_DIV1;  }
        else if (pclk1 >= (hclk / 2)) { pclk1 = hclk / 2;  ppre1 = RCC_CFGR_PPRE1_DIV2;  }
        else if (pclk1 >= (hclk / 4)) { pclk1 = hclk / 4;  ppre1 = RCC_CFGR_PPRE1_DIV4;  }
        else if (pclk1 >= (hclk / 8)) { pclk1 = hclk / 8;  ppre1 = RCC_CFGR_PPRE1_DIV8;  }
        else                          { pclk1 = hclk / 16; ppre1 = RCC_CFGR_PPRE1_DIV16; }
    }
    else
    {
        if      (hclk >= 64000000)    { pclk1 = hclk / 4;  ppre1 = RCC_CFGR_PPRE1_DIV4;  }
        else if (hclk >= 32000000)    { pclk1 = hclk / 2;  ppre1 = RCC_CFGR_PPRE1_DIV2;  }
        else                          { pclk1 = hclk / 1;  ppre1 = RCC_CFGR_PPRE1_DIV1;  }
    }

    if (pclk2)
    {
        if      (pclk2 >= (hclk / 1)) { pclk2 = hclk / 1;  ppre2 = RCC_CFGR_PPRE2_DIV1;  }
        else if (pclk2 >= (hclk / 2)) { pclk2 = hclk / 2;  ppre2 = RCC_CFGR_PPRE2_DIV2;  }
        else if (pclk2 >= (hclk / 4)) { pclk2 = hclk / 4;  ppre2 = RCC_CFGR_PPRE2_DIV4;  }
        else if (pclk2 >= (hclk / 8)) { pclk2 = hclk / 8;  ppre2 = RCC_CFGR_PPRE2_DIV8;  }
        else                          { pclk2 = hclk / 16; ppre2 = RCC_CFGR_PPRE2_DIV16; }
    }
    else
    {
        if      (hclk >= 32000000)    { pclk2 = hclk / 2;  ppre2 = RCC_CFGR_PPRE2_DIV2;  }
        else                          { pclk2 = hclk / 1;  ppre2 = RCC_CFGR_PPRE2_DIV1;  }
    }

    stm32wb_system_sysclk_ext_compute(sysclk, hclk, &latency, &c2hpre, &shdhpre);

    if ((sysclk >= 32000000) && (stm32wb_system_device.options & (STM32WB_SYSTEM_OPTION_SMPS_INDUCTOR_10uH | STM32WB_SYSTEM_OPTION_SMPS_INDUCTOR_2_2uH)))
    {
        smps = true;
        smpsvos = ((*((const uint32_t*)0x1fff7558) >> 8) & 15);

        if (stm32wb_system_device.reference & STM32WB_SYSTEM_REFERENCE_WIRELESS)
        {
            if      (stm32wb_system_device.palevel == 0x1f) { smpsvos += 5; } /* 1750mV */
            else if (stm32wb_system_device.palevel == 0x1e) { smpsvos += 2; } /* 1600mV */
            else                                            { smpsvos -= 1; } /* 1450mV */
        }
        else
        {
            smpsvos -= 1; /* 1450mV */
        }
    }
    else
    {
        smps = false;
        smpsvos = 8;
    }

    primask = __get_PRIMASK();
    
    __disable_irq();
    
    if (stm32wb_system_device.lock[STM32WB_SYSTEM_LOCK_CLOCKS] ||
        (stm32wb_system_device.reference &
         (STM32WB_SYSTEM_REFERENCE_SAICLK_RANGE_1 |
          STM32WB_SYSTEM_REFERENCE_SAICLK_RANGE_2)) ||
        ((stm32wb_system_device.reference & STM32WB_SYSTEM_REFERENCE_WIRELESS) && (sysclk < 32000000)) ||
        ((stm32wb_system_device.reference & STM32WB_SYSTEM_REFERENCE_CPU2) && (sysclk < 16000000)) ||
        ((stm32wb_system_device.reference & STM32WB_SYSTEM_REFERENCE_USB) && (pclk1 < 16000000)))
    {
        __set_PRIMASK(primask);
        
        return false;
    }

    stm32wb_system_notify(STM32WB_SYSTEM_NOTIFY_CLOCKS_PROLOGUE);

    armv7m_systick_disable();
    
    if (sysclk <= STM32WB_SYSTEM_FREQUENCY_RANGE_2)
    {
        if (sysclk <= STM32WB_SYSTEM_FREQUENCY_LPRUN)
        {
            stm32wb_system_device.reference = stm32wb_system_device.reference & ~(STM32WB_SYSTEM_REFERENCE_SYSCLK_RANGE_1 | STM32WB_SYSTEM_REFERENCE_SYSCLK_RANGE_2);
        }
        else
        {
            stm32wb_system_device.reference = (stm32wb_system_device.reference & ~STM32WB_SYSTEM_REFERENCE_SYSCLK_RANGE_1) | STM32WB_SYSTEM_REFERENCE_SYSCLK_RANGE_2;
        }
    }
    else
    {
        stm32wb_system_device.reference = (stm32wb_system_device.reference & ~STM32WB_SYSTEM_REFERENCE_SYSCLK_RANGE_2) | STM32WB_SYSTEM_REFERENCE_SYSCLK_RANGE_1;
    }

    if (stm32wb_system_device.sysclk < sysclk)
    {
        /* Leave LPrun */
        if (PWR->CR1 & PWR_CR1_LPR)
        {
            PWR->CR1 &= ~PWR_CR1_LPR;
            
            while (PWR->SR2 & PWR_SR2_REGLPF)
            {
            }
        }
        
        /* Leave to Range 2 */
        if ((PWR->CR1 & PWR_CR1_VOS) == PWR_CR1_VOS_RANGE_2)
        {
            PWR->CR1 = (PWR->CR1 & ~PWR_CR1_VOS) | PWR_CR1_VOS_RANGE_1;
            
            while (PWR->SR2 & PWR_SR2_VOSF)
            {
            }
        }
    }

    if (stm32wb_system_device.smps && !smps)
    {
        PWR->CR5 = (PWR->CR5 & ~(PWR_CR5_SMPSEN | PWR_CR5_BORHC | PWR_CR5_SMPSVOS)) | (8 << PWR_CR5_SMPSVOS_Pos);
    }

    while (!stm32wb_hsem_trylock(STM32WB_HSEM_INDEX_FLASH, STM32WB_HSEM_PROCID_NONE))
    {
    }
    
    FLASH->ACR = FLASH_ACR_ICEN | FLASH_ACR_DCEN | FLASH_ACR_LATENCY_3WS;
    
    stm32wb_hsem_unlock(STM32WB_HSEM_INDEX_FLASH, STM32WB_HSEM_PROCID_NONE);
    
    while (!stm32wb_hsem_trylock(STM32WB_HSEM_INDEX_RCC, STM32WB_HSEM_PROCID_NONE))
    {
    }

    if (stm32wb_system_device.smps && !smps)
    {
        PWR->CR5 = (PWR->CR5 & ~(PWR_CR5_SMPSEN | PWR_CR5_BORHC | PWR_CR5_SMPSVOS)) | (8 << PWR_CR5_SMPSVOS_Pos);
    }
    
    if (stm32wb_system_device.sysclk != sysclk)
    {
        RCC->CFGR = (RCC->CFGR & ~(RCC_CFGR_HPRE | RCC_CFGR_PPRE1 | RCC_CFGR_PPRE2 | RCC_CFGR_HPREF | RCC_CFGR_PPRE1F | RCC_CFGR_PPRE2F)) | (RCC_CFGR_HPRE_DIV1 | RCC_CFGR_PPRE1_DIV1 | RCC_CFGR_PPRE2_DIV1);

