GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_system.c
        while ((RCC->CFGR & (RCC_CFGR_HPREF | RCC_CFGR_PPRE1F | RCC_CFGR_PPRE2F)) != (RCC_CFGR_HPREF | RCC_CFGR_PPRE1F | RCC_CFGR_PPRE2F))
        {
        }

        RCC->EXTCFGR = (RCC->EXTCFGR & ~(RCC_EXTCFGR_C2HPRE | RCC_EXTCFGR_C2HPREF)) | RCC_EXTCFGR_C2HPRE_DIV2;

        while ((RCC->EXTCFGR & RCC_EXTCFGR_C2HPREF) != RCC_EXTCFGR_C2HPREF)
        {
        }

        if (stm32wb_system_device.pllsys)
        {
            if (!(RCC->CR & RCC_CR_HSION))
            {
                RCC->CR |= RCC_CR_HSION;
                
                while (!(RCC->CR & RCC_CR_HSIRDY))
                {
                }
            }

            RCC->CFGR = (RCC->CFGR & ~RCC_CFGR_SW) | RCC_CFGR_SW_HSI;
                
            while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_HSI)
            {
            }

            RCC->CR &= ~RCC_CR_PLLON;

            while (RCC->CR & RCC_CR_PLLRDY)
            {
            }
        }
        
        if (hse)
        {
            if (!stm32wb_system_device.hse)
            {
                RCC->CR |= RCC_CR_HSEON;
                
                while (!(RCC->CR & RCC_CR_HSERDY))
                {
                }
            }

            RCC->SMPSCR = (RCC->SMPSCR & ~RCC_SMPSCR_SMPSSEL) | RCC_SMPSCR_SMPSSEL_HSE;
            
            /* HSI16 is wakeup clock */
            RCC->CFGR |= RCC_CFGR_STOPWUCK;
            
            stm32wb_system_device.hse |= 0x80;
            stm32wb_system_device.msi &= ~0x80;
        }
        else
        {
            RCC->CR = (RCC->CR & ~(RCC_CR_MSIRANGE | RCC_CR_MSIPLLEN)) | msirange | RCC_CR_MSION; 
            __DSB();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            
            while (!(RCC->CR & RCC_CR_MSIRDY))
            {
            }
            
            if (stm32wb_system_device.lseclk)
            {
                RCC->CR |= RCC_CR_MSIPLLEN;
            }

            RCC->SMPSCR = (RCC->SMPSCR & ~RCC_SMPSCR_SMPSSEL) | RCC_SMPSCR_SMPSSEL_MSI;

            /* Here HSI16 is selected as wakeup clock to allow CSS at some point.
             */
            
            /* HSI16 is wakeup clock */
            RCC->CFGR |= RCC_CFGR_STOPWUCK;
            
            stm32wb_system_device.hse &= ~0x80;
            stm32wb_system_device.msi |= 0x80;
        }

        RCC->PLLCFGR = pllcfg;

        if (pllsys)
        {
            RCC->CR |= RCC_CR_PLLON;
            
            while (!(RCC->CR & RCC_CR_PLLRDY))
            {
            }
            
            RCC->CFGR = (RCC->CFGR & ~RCC_CFGR_SW) | RCC_CFGR_SW_PLL;
            
            while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_PLL)
            {
            }
        }
        else
        {
            if (hse)
            {
                RCC->CFGR = (RCC->CFGR & ~RCC_CFGR_SW) | RCC_CFGR_SW_HSE;
                
                while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_HSE)
                {
                }
            }
            else
            {
                RCC->CFGR = (RCC->CFGR & ~RCC_CFGR_SW) | RCC_CFGR_SW_MSI;
                
                while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_MSI)
                {
                }
            }
        }
    }
    
    RCC->CFGR = (RCC->CFGR & ~(RCC_CFGR_HPRE | RCC_CFGR_PPRE1 | RCC_CFGR_PPRE2 | RCC_CFGR_HPREF | RCC_CFGR_PPRE1F | RCC_CFGR_PPRE2F)) | hpre | ppre1 | ppre2;
    
    while ((RCC->CFGR & (RCC_CFGR_HPREF | RCC_CFGR_PPRE1F | RCC_CFGR_PPRE2F)) != (RCC_CFGR_HPREF | RCC_CFGR_PPRE1F | RCC_CFGR_PPRE2F))
    {
    }
    
    RCC->EXTCFGR = (RCC->EXTCFGR & ~(RCC_EXTCFGR_SHDHPRE | RCC_EXTCFGR_C2HPRE | RCC_EXTCFGR_SHDHPREF | RCC_EXTCFGR_C2HPREF)) | shdhpre | c2hpre;
    
    while ((RCC->EXTCFGR & (RCC_EXTCFGR_SHDHPREF | RCC_EXTCFGR_C2HPREF)) != (RCC_EXTCFGR_SHDHPREF | RCC_EXTCFGR_C2HPREF))
    {
    }

    if (!stm32wb_system_device.hsi16)
    {
        RCC->CR &= ~RCC_CR_HSION;
    }

    if (!stm32wb_system_device.msi)
    {
        RCC->CR &= ~(RCC_CR_MSIPLLEN | RCC_CR_MSION);
    }

    if (!stm32wb_system_device.hse)
    {
        RCC->CR &= ~RCC_CR_HSEON;
    }
    
    stm32wb_hsem_unlock(STM32WB_HSEM_INDEX_RCC, STM32WB_HSEM_PROCID_NONE);

    while (!stm32wb_hsem_trylock(STM32WB_HSEM_INDEX_FLASH, STM32WB_HSEM_PROCID_NONE))
    {
    }

    FLASH->ACR = FLASH_ACR_ICEN | FLASH_ACR_DCEN | latency;

    stm32wb_hsem_unlock(STM32WB_HSEM_INDEX_FLASH, STM32WB_HSEM_PROCID_NONE);

    if (smps)
    {
        PWR->CR5 = (PWR->CR5 & ~PWR_CR5_SMPSVOS) | (PWR_CR5_SMPSEN | PWR_CR5_BORHC | (smpsvos << PWR_CR5_SMPSVOS_Pos));
    }
    
    /* Enter Range 2 */
    if (!(stm32wb_system_device.reference & STM32WB_SYSTEM_REFERENCE_RANGE_1))
    {
        if ((PWR->CR1 & PWR_CR1_VOS) == PWR_CR1_VOS_RANGE_1)
        {
            PWR->CR1 = (PWR->CR1 & ~PWR_CR1_VOS) | PWR_CR1_VOS_RANGE_2;
        }
    }
    
    /* Enter LPrun */
    if (!(stm32wb_system_device.reference & STM32WB_SYSTEM_REFERENCE_RANGE_1_2))
    {
        PWR->CR1 |= PWR_CR1_LPR;
    }

    SystemCoreClock = hclk;
    
    stm32wb_system_device.sysclk   = sysclk;
    stm32wb_system_device.hclk     = hclk;
    stm32wb_system_device.pclk1    = pclk1;
    stm32wb_system_device.pclk2    = pclk2;

    stm32wb_system_device.pllsys   = pllsys;
    stm32wb_system_device.latency  = latency;
    stm32wb_system_device.smps     = smps;
    stm32wb_system_device.msirange = msirange;
    stm32wb_system_device.c2hpre   = c2hpre;

    armv7m_core_configure();
    armv7m_systick_configure(tclk);
    
    armv7m_systick_enable();

    stm32wb_system_notify(STM32WB_SYSTEM_NOTIFY_CLOCKS_EPILOGUE);

    __set_PRIMASK(primask);
    
    return true;
}

static void stm32wb_system_voltage_increase(void)
{
    /* Leave LPrun */
    if (stm32wb_system_device.reference & STM32WB_SYSTEM_REFERENCE_RANGE_1_2)
    {
        if (PWR->CR1 & PWR_CR1_LPR)
        {
            PWR->CR1 &= ~PWR_CR1_LPR;
        
            while (PWR->SR2 & PWR_SR2_REGLPF)
            {
            }
        }
    }
    
    /* Leave Range 2 */
    if (stm32wb_system_device.reference & STM32WB_SYSTEM_REFERENCE_RANGE_1)
    {
        if ((PWR->CR1 & PWR_CR1_VOS) == PWR_CR1_VOS_RANGE_2)
        {
            PWR->CR1 = (PWR->CR1 & ~PWR_CR1_VOS) | PWR_CR1_VOS_RANGE_1;
            
            while (PWR->SR2 & PWR_SR2_VOSF)
            {
            }
        }
    }
}

static void stm32wb_system_voltage_decrease(void)
{
    /* Enter Range 2 */
    if (!(stm32wb_system_device.reference & STM32WB_SYSTEM_REFERENCE_RANGE_1))
    {
        if ((PWR->CR1 & PWR_CR1_VOS) == PWR_CR1_VOS_RANGE_1)
        {
            PWR->CR1 = (PWR->CR1 & ~PWR_CR1_VOS) | PWR_CR1_VOS_RANGE_2;
        }
    }
    
    /* Enter LPrun */
    if (!(stm32wb_system_device.reference & STM32WB_SYSTEM_REFERENCE_RANGE_1_2))
    {
        PWR->CR1 |= PWR_CR1_LPR;
    }
}

static void stm32wb_system_wireless_enter(void)
{
    RCC->CFGR = (RCC->CFGR & ~RCC_CFGR_SW) | RCC_CFGR_SW_HSE;
                
    while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_HSE)
    {
    }
    
    if (stm32wb_system_device.pllsys)
    {
        RCC->CR &= ~RCC_CR_PLLON;

        while (RCC->CR & RCC_CR_PLLRDY)
        {
        }

        RCC->PLLCFGR = ((1 << RCC_PLLCFGR_PLLR_Pos) | (64000000 / (4000000 / 2)) << RCC_PLLCFGR_PLLN_Pos) | (((8-1) << RCC_PLLCFGR_PLLM_Pos) | RCC_PLLCFGR_PLLREN | RCC_PLLCFGR_PLLSRC_HSE);
        
        RCC->CR |= RCC_CR_PLLON;
        
        while (!(RCC->CR & RCC_CR_PLLRDY))
        {
        }
        
        RCC->CFGR = (RCC->CFGR & ~RCC_CFGR_SW) | RCC_CFGR_SW_PLL;
        
        while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_PLL)
        {
        }
    }
    else
    {
        RCC->PLLCFGR = (((8-1) << RCC_PLLCFGR_PLLM_Pos) | RCC_PLLCFGR_PLLSRC_HSE);
    }

