GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_system.c
    RCC->SMPSCR = (RCC->SMPSCR & ~RCC_SMPSCR_SMPSSEL) | RCC_SMPSCR_SMPSSEL_HSE;
    
    stm32wb_system_device.msi &= ~0x80;
    
    if (!stm32wb_system_device.msi)
    {
        RCC->CR &= ~(RCC_CR_MSIPLLEN | RCC_CR_MSION);
    }
}

static void stm32wb_system_wireless_leave(void)
{
    RCC->CR = (RCC->CR & ~(RCC_CR_MSIRANGE | RCC_CR_MSIPLLEN)) | stm32wb_system_device.msirange | RCC_CR_MSION; 
    __DSB();
    __NOP();
    __NOP();
    __NOP();
    __NOP();
    __NOP();
    __NOP();
    __NOP();
    __NOP();
    __NOP();
    __NOP();
    __NOP();
    __NOP();
    __NOP();
    __NOP();
    __NOP();
    __NOP();
    
    while (!(RCC->CR & RCC_CR_MSIRDY))
    {
    }
    
    if (stm32wb_system_device.lseclk)
    {
        RCC->CR |= RCC_CR_MSIPLLEN;
    }
    
    RCC->CFGR = (RCC->CFGR & ~RCC_CFGR_SW) | RCC_CFGR_SW_MSI;
    
    while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_MSI)
    {
    }
    
    if (stm32wb_system_device.pllsys)
    {
        RCC->CR &= ~RCC_CR_PLLON;

        while (RCC->CR & RCC_CR_PLLRDY)
        {
        }
        
        RCC->PLLCFGR = ((1 << RCC_PLLCFGR_PLLR_Pos) | (64000000 / (4000000 / 2)) << RCC_PLLCFGR_PLLN_Pos) | (((4-1) << RCC_PLLCFGR_PLLM_Pos) | RCC_PLLCFGR_PLLREN | RCC_PLLCFGR_PLLSRC_MSI);
        
        RCC->CR |= RCC_CR_PLLON;
        
        while (!(RCC->CR & RCC_CR_PLLRDY))
        {
        }
        
        RCC->CFGR = (RCC->CFGR & ~RCC_CFGR_SW) | RCC_CFGR_SW_PLL;
        
        while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_PLL)
        {
        }
    }
    else
    {
        RCC->PLLCFGR = (((8-1) << RCC_PLLCFGR_PLLM_Pos) | RCC_PLLCFGR_PLLSRC_MSI);
    }
    
    RCC->SMPSCR = (RCC->SMPSCR & ~RCC_SMPSCR_SMPSSEL) | RCC_SMPSCR_SMPSSEL_MSI;
    
    stm32wb_system_device.hse &= ~0x80;
    stm32wb_system_device.msi |= 0x80;
    
    if (!stm32wb_system_device.hse)
    {
        RCC->CR &= ~RCC_CR_HSEON;
    }
}

static bool __svc_stm32wb_system_saiclk_configure(uint32_t saiclk)
{
    uint32_t reference, pllcfg;

    if (stm32wb_system_device.saiclk != saiclk)
    {
        stm32wb_system_unreference(STM32WB_SYSTEM_REFERENCE_SAICLK_RANGE_1 | STM32WB_SYSTEM_REFERENCE_SAICLK_RANGE_2);

        if (saiclk != STM32WB_SYSTEM_SAICLK_NONE)
        {
            if (stm32wb_system_device.sysclk <= STM32WB_SYSTEM_FREQUENCY_RANGE_2)
            {
                /* 4MHz PLL input */
                switch (saiclk) {
                case STM32WB_SYSTEM_SAICLK_11289600:
                    reference = STM32WB_SYSTEM_REFERENCE_SAICLK_RANGE_2;
                    pllcfg = (((11 -1) << RCC_PLLSAI1CFGR_PLLP_Pos) | (31 << RCC_PLLSAI1CFGR_PLLN_Pos) | RCC_PLLSAI1CFGR_PLLPEN);
                    break;

                case STM32WB_SYSTEM_SAICLK_24576000:
                    reference = STM32WB_SYSTEM_REFERENCE_SAICLK_RANGE_2;
                    pllcfg = (((5 -1) << RCC_PLLSAI1CFGR_PLLP_Pos) | (31 << RCC_PLLSAI1CFGR_PLLN_Pos) | RCC_PLLSAI1CFGR_PLLPEN);
                    break;

                default:
                    return false;
                }
            }
            else
            {
                /* 4MHz PLL input */
                switch (saiclk) {
                case STM32WB_SYSTEM_SAICLK_11289600:
                    reference = STM32WB_SYSTEM_REFERENCE_SAICLK_RANGE_1;
                    pllcfg = (((17 -1) << RCC_PLLSAI1CFGR_PLLP_Pos) | (48 << RCC_PLLSAI1CFGR_PLLN_Pos) | RCC_PLLSAI1CFGR_PLLPEN);
                    break;
                    
                case STM32WB_SYSTEM_SAICLK_24576000:
                    reference = STM32WB_SYSTEM_REFERENCE_SAICLK_RANGE_1;
                    pllcfg = (((7 -1) << RCC_PLLSAI1CFGR_PLLP_Pos) | (43 << RCC_PLLSAI1CFGR_PLLN_Pos) | RCC_PLLSAI1CFGR_PLLPEN);
                    break;
                    
                default:
                    return false;
                }
            }
            
            stm32wb_system_reference(reference);

            if (stm32wb_system_device.saiclk < saiclk)
            {
                stm32wb_system_voltage_increase();
            }
            
            while (!stm32wb_hsem_trylock(STM32WB_HSEM_INDEX_RCC, STM32WB_HSEM_PROCID_NONE))
            {
            }
            
            RCC->CR &= ~RCC_CR_PLLSAI1ON;

            while (RCC->CR & RCC_CR_PLLSAI1RDY)
            {
            }

            RCC->PLLSAI1CFGR = pllcfg;

            RCC->CR |= RCC_CR_PLLSAI1ON;
            
            while (!(RCC->CR & RCC_CR_PLLSAI1RDY))
            {
            }

            stm32wb_hsem_unlock(STM32WB_HSEM_INDEX_RCC, STM32WB_HSEM_PROCID_NONE);

            if (stm32wb_system_device.saiclk > saiclk)
            {
                stm32wb_system_voltage_decrease();
            }
        }
        else
        {
            while (!stm32wb_hsem_trylock(STM32WB_HSEM_INDEX_RCC, STM32WB_HSEM_PROCID_NONE))
            {
            }

            RCC->CR &= ~RCC_CR_PLLSAI1ON;

            while (RCC->CR & RCC_CR_PLLSAI1RDY)
            {
            }

            if (stm32wb_system_device.reference & STM32WB_SYSTEM_REFERENCE_WIRELESS)
            {
                if (stm32wb_system_device.msi & 0x80)
                {
                    stm32wb_system_wireless_enter();
                }
            }
            else
            {
                if (stm32wb_system_device.hse & 0x80)
                {
                    stm32wb_system_wireless_leave();
                }
            }
            
            stm32wb_hsem_unlock(STM32WB_HSEM_INDEX_RCC, STM32WB_HSEM_PROCID_NONE);

            stm32wb_system_voltage_decrease();
        }
        
        stm32wb_system_device.saiclk = saiclk;
    }

    return true;
}

static bool __svc_stm32wb_system_mco_configure(uint32_t mco)
{
    uint32_t mcosel, mcopre;
    
    switch (stm32wb_system_device.mco & STM32WB_SYSTEM_MCO_SOURCE_MASK) {
    case STM32WB_SYSTEM_MCO_SOURCE_NONE:
    case STM32WB_SYSTEM_MCO_SOURCE_SYSCLK:
    case STM32WB_SYSTEM_MCO_SOURCE_MSI:
    case STM32WB_SYSTEM_MCO_SOURCE_HSE:
    case STM32WB_SYSTEM_MCO_SOURCE_PLL:
    case STM32WB_SYSTEM_MCO_SOURCE_LSE:
    case STM32WB_SYSTEM_MCO_SOURCE_HSI48:
        break;
        
