GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_system.c
    case STM32WB_SYSTEM_MCO_SOURCE_LSI:
        stm32wb_system_lsi_disable();
        break;
        
    case STM32WB_SYSTEM_MCO_SOURCE_HSI16:
        stm32wb_system_hsi16_disable();
        break;
    }
    
    stm32wb_system_device.mco = mco;
    
    switch (mco & STM32WB_SYSTEM_MCO_SOURCE_MASK) {
    case STM32WB_SYSTEM_MCO_SOURCE_NONE:
    case STM32WB_SYSTEM_MCO_SOURCE_SYSCLK:
    case STM32WB_SYSTEM_MCO_SOURCE_MSI:
    case STM32WB_SYSTEM_MCO_SOURCE_HSE:
    case STM32WB_SYSTEM_MCO_SOURCE_PLL:
    case STM32WB_SYSTEM_MCO_SOURCE_LSE:
    case STM32WB_SYSTEM_MCO_SOURCE_HSI48:
        break;
        
    case STM32WB_SYSTEM_MCO_SOURCE_LSI:
        stm32wb_system_lsi_enable();
        break;
        
    case STM32WB_SYSTEM_MCO_SOURCE_HSI16:
        stm32wb_system_hsi16_enable();
        break;
    }

    mcosel = (mco & STM32WB_SYSTEM_MCO_SOURCE_MASK) >> STM32WB_SYSTEM_MCO_SOURCE_SHIFT;
    mcopre = (mco & STM32WB_SYSTEM_MCO_DIVIDE_MASK) >> STM32WB_SYSTEM_MCO_DIVIDE_SHIFT;

    while (!stm32wb_hsem_trylock(STM32WB_HSEM_INDEX_RCC, STM32WB_HSEM_PROCID_NONE))
    {
    }

    RCC->CFGR = (RCC->CFGR & ~(RCC_CFGR_MCOSEL | RCC_CFGR_MCOPRE)) | (((mcosel << RCC_CFGR_MCOSEL_Pos) | (mcopre << RCC_CFGR_MCOPRE_Pos)));

    stm32wb_hsem_unlock(STM32WB_HSEM_INDEX_RCC, STM32WB_HSEM_PROCID_NONE);

    return true;
}

static bool __svc_stm32wb_system_lsco_configure(uint32_t lsco)
{
    if (lsco == STM32WB_SYSTEM_LSCO_SOURCE_LSI)
    {
        if (stm32wb_system_device.lsco != STM32WB_SYSTEM_LSCO_SOURCE_LSI)
        {
            stm32wb_system_lsi_enable();
        }
        
        RCC->BDCR = (RCC->BDCR & ~(RCC_BDCR_LSCOEN | RCC_BDCR_LSCOSEL)) | (RCC_BDCR_LSCOEN | RCC_BDCR_LSCOSEL);
    }
    else
    {
        if (stm32wb_system_device.lsco == STM32WB_SYSTEM_LSCO_SOURCE_LSI)
        {
            stm32wb_system_lsi_disable();
        }

        if (lsco == STM32WB_SYSTEM_LSCO_SOURCE_LSE)
        {
            RCC->BDCR = (RCC->BDCR & ~(RCC_BDCR_LSCOEN | RCC_BDCR_LSCOSEL)) | (RCC_BDCR_LSCOEN);
        }
        else
        {
            RCC->BDCR = (RCC->BDCR & ~(RCC_BDCR_LSCOEN | RCC_BDCR_LSCOSEL));
        }
    }
    
    stm32wb_system_device.lsco = lsco;

    return true;
}

static bool __svc_stm32wb_system_smps_configure(uint32_t palevel)
{
    uint32_t smpsvos;
    
    stm32wb_system_device.palevel = palevel;

    if (stm32wb_system_device.smps)
    {
        if (stm32wb_system_device.reference & STM32WB_SYSTEM_REFERENCE_WIRELESS)
        {
            smpsvos = ((*((const uint32_t*)0x1fff7558) >> 8) & 15);

            if      (palevel == 0x1f) { smpsvos += 5; } /* 1750mV */
            else if (palevel == 0x1e) { smpsvos += 2; } /* 1600mV */
            else                      { smpsvos -= 1; } /* 1450mV */

            PWR->CR5 = (PWR->CR5 & ~PWR_CR5_SMPSVOS) | (PWR_CR5_SMPSEN | PWR_CR5_BORHC | (smpsvos << PWR_CR5_SMPSVOS_Pos));
        }
    }

    return true;
}

static bool __svc_stm32wb_system_cpu2_boot(void)
{
    if (stm32wb_system_device.sysclk < 16000000)
    {
        return false;
    }

    if (armv7m_atomic_or(&stm32wb_system_device.reference, STM32WB_SYSTEM_REFERENCE_CPU2) & STM32WB_SYSTEM_REFERENCE_CPU2)
    {
        return true;
    }
   
    stm32wb_system_sysclk_ext_configure(stm32wb_system_device.sysclk, stm32wb_system_device.hclk);

    PWR->C2CR1 &= ~PWR_C2CR1_LPMS;

    PWR->CR4 |= PWR_CR4_C2BOOT;

    return true;
}

static bool __svc_stm32wb_system_wireless_enable(void)
{
    uint32_t smpsvos;
    
    if (!stm32wb_system_device.lseclk || !stm32wb_system_device.hseclk || (stm32wb_system_device.sysclk < 32000000))
    {
        return false;
    }

    if (!(stm32wb_system_device.reference & STM32WB_SYSTEM_REFERENCE_CPU2))
    {
        return false;
    }
    
    if (armv7m_atomic_or(&stm32wb_system_device.reference, STM32WB_SYSTEM_REFERENCE_WIRELESS) & STM32WB_SYSTEM_REFERENCE_WIRELESS)
    {
        return true;
    }

    stm32wb_system_sysclk_ext_configure(stm32wb_system_device.sysclk, stm32wb_system_device.hclk);
    
    if (stm32wb_system_device.smps)
    {
        smpsvos = ((*((const uint32_t*)0x1fff7558) >> 8) & 15);

        if      (stm32wb_system_device.palevel == 0x1f) { smpsvos += 5; } /* 1750mV */
        else if (stm32wb_system_device.palevel == 0x1e) { smpsvos += 2; } /* 1600mV */
        else                                            { smpsvos -= 1; } /* 1450mV */

        PWR->CR5 = (PWR->CR5 & ~PWR_CR5_SMPSVOS) | (PWR_CR5_SMPSEN | PWR_CR5_BORHC | (smpsvos << PWR_CR5_SMPSVOS_Pos));
    }

    if (!stm32wb_system_device.hse)
    {
        RCC->CR |= RCC_CR_HSEON;
                
        while (!(RCC->CR & RCC_CR_HSERDY))
        {
        }
    }

    stm32wb_system_device.hse |= 0x80;

    if (stm32wb_system_device.saiclk == STM32WB_SYSTEM_SAICLK_NONE)
    {
        stm32wb_system_wireless_enter();
    }
    
    stm32wb_system_lock(STM32WB_SYSTEM_LOCK_STOP_2);
    
    return true;
}

static bool __svc_stm32wb_system_wireless_disable(void)
{
    uint32_t smpsvos;

    if (!(armv7m_atomic_and(&stm32wb_system_device.reference, ~STM32WB_SYSTEM_REFERENCE_WIRELESS) & STM32WB_SYSTEM_REFERENCE_WIRELESS))
    {
        return true;
    }

    stm32wb_system_unlock(STM32WB_SYSTEM_LOCK_STOP_2);

    if (stm32wb_system_device.saiclk == STM32WB_SYSTEM_SAICLK_NONE)
    {
        stm32wb_system_wireless_leave();
    }
    
    if (stm32wb_system_device.smps)
    {
        smpsvos = ((*((const uint32_t*)0x1fff7558) >> 8) & 15);

        smpsvos -= 1; /* 1450mV */

        PWR->CR5 = (PWR->CR5 & ~PWR_CR5_SMPSVOS) | (PWR_CR5_SMPSEN | PWR_CR5_BORHC | (smpsvos << PWR_CR5_SMPSVOS_Pos));
    }

    stm32wb_system_sysclk_ext_configure(stm32wb_system_device.sysclk, stm32wb_system_device.hclk);

    return true;
}

static bool __svc_stm32wb_system_pvm1_enable(stm32wb_system_pvm1_callback_t callback, void *context)
{
    armv7m_atomic_and(&EXTI->IMR1, ~EXTI_IMR1_IM31);
    EXTI->PR1 = EXTI_PR1_PIF31;

    PWR->CR2 |= PWR_CR2_PVME1;

    /* allow PVM / VREFINT to power up */
    armv7m_core_udelay(20);

    stm32wb_system_device.pvm1_callback = callback;
    stm32wb_system_device.pvm1_context  = context;

    armv7m_atomic_or(&EXTI->RTSR1, EXTI_RTSR1_RT31);
    armv7m_atomic_or(&EXTI->FTSR1, EXTI_FTSR1_FT31);
    armv7m_atomic_or(&EXTI->IMR1, EXTI_IMR1_IM31);

