GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_system.c
    return true;
}

static bool __svc_stm32wb_system_pvm1_disable(void)
{
    armv7m_atomic_and(&EXTI->IMR1, ~EXTI_IMR1_IM31);
    EXTI->PR1 = EXTI_PR1_PIF31;

    PWR->CR2 &= ~PWR_CR2_PVME1;

    stm32wb_system_device.pvm1_callback = NULL;
    stm32wb_system_device.pvm1_context = NULL;

    return true;
}

static bool __svc_stm32wb_system_clk48_enable(void)
{
    stm32wb_system_device.clk48++;

    if (stm32wb_system_device.clk48 == 1)
    {
        stm32wb_system_voltage_increase();
        
        RCC->CRRCR |= RCC_CRRCR_HSI48ON;
        
        while(!(RCC->CRRCR & RCC_CRRCR_HSI48RDY))
        {
        }
        
        stm32wb_hsem_trylock(STM32WB_HSEM_INDEX_CLK48, STM32WB_HSEM_PROCID_NONE);
            
        stm32wb_system_reference(STM32WB_SYSTEM_REFERENCE_HSI48);

        stm32wb_system_lock(STM32WB_SYSTEM_LOCK_SLEEP);
    }
    
    return true;
}

static bool __svc_stm32wb_system_clk48_disable(void)
{
    if (stm32wb_system_device.clk48 == 1)
    {
        stm32wb_system_unlock(STM32WB_SYSTEM_LOCK_SLEEP);

        stm32wb_system_unreference(STM32WB_SYSTEM_REFERENCE_HSI48);

        stm32wb_hsem_unlock(STM32WB_HSEM_INDEX_CLK48, STM32WB_HSEM_PROCID_NONE);
        
        RCC->CRRCR &= ~RCC_CRRCR_HSI48ON;

        stm32wb_system_voltage_decrease();
    }

    stm32wb_system_device.clk48--;

    return true;
}

/*****************************************************************************************************/

bool stm32wb_system_sysclk_configure(uint32_t sysclk, uint32_t hclk, uint32_t pclk1, uint32_t pclk2)
{
    if (armv7m_core_is_in_thread())
    {
        return armv7m_svcall_4((uint32_t)&__svc_stm32wb_system_sysclk_configure, sysclk, hclk, pclk1, pclk2);
    }

    if (armv7m_core_is_in_svcall_or_pendsv())
    {
        return __svc_stm32wb_system_sysclk_configure(sysclk, hclk, pclk1, pclk2);
    }

    return false;
}

bool stm32wb_system_saiclk_configure(uint32_t saiclk)
{
    if (armv7m_core_is_in_thread())
    {
        return armv7m_svcall_1((uint32_t)&__svc_stm32wb_system_saiclk_configure, saiclk);
    }

    if (armv7m_core_is_in_svcall_or_pendsv())
    {
        return __svc_stm32wb_system_saiclk_configure(saiclk);
    }

    return false;
}

bool stm32wb_system_mco_configure(uint32_t mco)
{
    if (armv7m_core_is_in_thread())
    {
        return armv7m_svcall_1((uint32_t)&__svc_stm32wb_system_mco_configure, mco);
    }

    if (armv7m_core_is_in_svcall_or_pendsv())
    {
        return __svc_stm32wb_system_mco_configure(mco);
    }

    return false;
}

bool stm32wb_system_lsco_configure(uint32_t lsco)
{
    if (armv7m_core_is_in_thread())
    {
        return armv7m_svcall_1((uint32_t)&__svc_stm32wb_system_lsco_configure, lsco);
    }

    if (armv7m_core_is_in_svcall_or_pendsv())
    {
        return __svc_stm32wb_system_lsco_configure(lsco);
    }

    return false;
}

bool stm32wb_system_smps_configure(uint32_t palevel)
{
    if (armv7m_core_is_in_thread())
    {
        return armv7m_svcall_1((uint32_t)&__svc_stm32wb_system_smps_configure, palevel);
    }

    if (armv7m_core_is_in_svcall_or_pendsv())
    {
        return __svc_stm32wb_system_smps_configure(palevel);
    }

    return false;
}

bool stm32wb_system_cpu2_boot(void)
{
    if (armv7m_core_is_in_thread())
    {
        return armv7m_svcall_0((uint32_t)&__svc_stm32wb_system_cpu2_boot);
    }

    if (armv7m_core_is_in_svcall_or_pendsv())
    {
        return __svc_stm32wb_system_cpu2_boot();
    }

    return false;
}

bool stm32wb_system_wireless_enable(void)
{
    if (armv7m_core_is_in_thread())
    {
        return armv7m_svcall_0((uint32_t)&__svc_stm32wb_system_wireless_enable);
    }

    if (armv7m_core_is_in_svcall_or_pendsv())
    {
        return __svc_stm32wb_system_wireless_enable();
    }

    return false;
}

bool stm32wb_system_wireless_disable(void)
{
    if (armv7m_core_is_in_thread())
    {
        return armv7m_svcall_0((uint32_t)&__svc_stm32wb_system_wireless_disable);
    }

    if (armv7m_core_is_in_svcall_or_pendsv())
    {
        return __svc_stm32wb_system_wireless_disable();
    }

    return false;
}

bool stm32wb_system_pvm1_enable(stm32wb_system_pvm1_callback_t callback, void *context)
{
    if (armv7m_core_is_in_thread())
    {
        return armv7m_svcall_2((uint32_t)&__svc_stm32wb_system_pvm1_enable, (uint32_t)callback, (uint32_t)context);
    }

    if (armv7m_core_is_in_svcall_or_pendsv())
    {
        return __svc_stm32wb_system_pvm1_enable(callback, context);
    }

    return false;
}

bool stm32wb_system_pvm1_disable(void)
{
    if (armv7m_core_is_in_thread())
    {
        return armv7m_svcall_0((uint32_t)&__svc_stm32wb_system_pvm1_disable);
    }

    if (armv7m_core_is_in_svcall_or_pendsv())
    {
        return __svc_stm32wb_system_pvm1_disable();
    }

    return false;
}

bool stm32wb_system_pvm1_sense(void)
{
    return !(PWR->SR2 & PWR_SR2_PVMO1);
}

bool stm32wb_system_clk48_enable(void)
{
    if (armv7m_core_is_in_thread())
    {
        return armv7m_svcall_0((uint32_t)&__svc_stm32wb_system_clk48_enable);
    }

    if (armv7m_core_is_in_svcall_or_pendsv())
    {
        return __svc_stm32wb_system_clk48_enable();
    }

    return false;
}

bool stm32wb_system_clk48_disable(void)
{
    if (armv7m_core_is_in_thread())
    {
        return armv7m_svcall_0((uint32_t)&__svc_stm32wb_system_clk48_disable);
    }

    if (armv7m_core_is_in_svcall_or_pendsv())
    {
        return __svc_stm32wb_system_clk48_disable();
    }

    return false;
}

void stm32wb_system_lsi_enable(void)
{
    armv7m_atomic_incb(&stm32wb_system_device.lsi);

    if (!(stm32wb_system_device.lsi & 0x80))
    {
        armv7m_atomic_or(&RCC->CSR, RCC_CSR_LSI1ON);
    
        while (!(RCC->CSR & RCC_CSR_LSI1RDY))
        {
        }
    }
}

void stm32wb_system_lsi_disable(void)
{
    armv7m_atomic_decb(&stm32wb_system_device.lsi);

    if (!(stm32wb_system_device.lsi & 0x80))
    {
        armv7m_atomic_andzb(&RCC->CSR, ~RCC_CSR_LSI1ON, &stm32wb_system_device.lsi);
    }
}

void stm32wb_system_hsi16_enable(void)
{
    armv7m_atomic_incb(&stm32wb_system_device.hsi16);

