GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_system.c
    if (!(stm32wb_system_device.hsi16 & 0x80))
    {
        while (!stm32wb_hsem_trylock(STM32WB_HSEM_INDEX_RCC, STM32WB_HSEM_PROCID_NONE))
        {
        }

        armv7m_atomic_or(&RCC->CR, RCC_CR_HSION);
        
        while (!(RCC->CR & RCC_CR_HSIRDY))
        {
        }

        stm32wb_hsem_unlock(STM32WB_HSEM_INDEX_RCC, STM32WB_HSEM_PROCID_NONE);
    }
}

void stm32wb_system_hsi16_disable(void)
{
    armv7m_atomic_decb(&stm32wb_system_device.hsi16);

    if (!(stm32wb_system_device.hsi16 & 0x80))
    {
        while (!stm32wb_hsem_trylock(STM32WB_HSEM_INDEX_RCC, STM32WB_HSEM_PROCID_NONE))
        {
        }

        armv7m_atomic_andzb(&RCC->CR, ~RCC_CR_HSION, &stm32wb_system_device.hsi16);

        stm32wb_hsem_unlock(STM32WB_HSEM_INDEX_RCC, STM32WB_HSEM_PROCID_NONE);
    }
}

uint32_t stm32wb_system_reset_cause(void)
{
    return __stm32wb_system_reset;
}

uint32_t stm32wb_system_wakeup_reason(void)
{
    return __stm32wb_system_wakeup;
}

uint32_t stm32wb_system_options(void)
{
    return stm32wb_system_device.options;
}

uint32_t stm32wb_system_lseclk(void)
{
    return stm32wb_system_device.lseclk;
}

uint32_t stm32wb_system_hseclk(void)
{
    return stm32wb_system_device.hseclk;
}

uint32_t stm32wb_system_sysclk(void)
{
    return stm32wb_system_device.sysclk;
}

uint32_t stm32wb_system_hclk(void)
{
    return stm32wb_system_device.hclk;
}

uint32_t stm32wb_system_pclk1(void)
{
    return stm32wb_system_device.pclk1;
}

uint32_t stm32wb_system_pclk2(void)
{
    return stm32wb_system_device.pclk2;
}

uint32_t stm32wb_system_saiclk(void)
{
    return stm32wb_system_device.saiclk;
}

bool stm32wb_system_cpu2(void)
{
    return !!(PWR->CR4 & PWR_CR4_C2BOOT);
}

bool stm32wb_system_wireless(void)
{
    return (stm32wb_system_device.reference & STM32WB_SYSTEM_REFERENCE_WIRELESS);
}

uint64_t stm32wb_system_serial(void)
{
    uint32_t uid[3];
    
    uid[0] = *((const uint32_t*)(UID_BASE + 0x00));
    uid[1] = *((const uint32_t*)(UID_BASE + 0x04));
    uid[2] = *((const uint32_t*)(UID_BASE + 0x08));

    /* This crummy value is what the USB/DFU bootloader uses.
     */
    return (((uint64_t)(uid[0] + uid[2]) << 16) | (uint64_t)(uid[1] >> 16));
}

void stm32wb_system_uid(uint32_t *uid)
{
    uid[0] = *((const uint32_t*)(UID_BASE + 0x00));
    uid[1] = *((const uint32_t*)(UID_BASE + 0x04));
    uid[2] = *((const uint32_t*)(UID_BASE + 0x08));
}

void stm32wb_system_periph_reset(uint32_t periph)
{
    __armv7m_atomic_or(stm32wb_system_xlate_RSTR[periph], stm32wb_system_xlate_RSTMSK[periph]);
    __armv7m_atomic_and(stm32wb_system_xlate_RSTR[periph], ~stm32wb_system_xlate_RSTMSK[periph]);
    *stm32wb_system_xlate_RSTR[periph];
}

void stm32wb_system_periph_enable(uint32_t periph)
{
    __armv7m_atomic_or(stm32wb_system_xlate_ENR[periph], stm32wb_system_xlate_ENMSK[periph]);
    *stm32wb_system_xlate_ENR[periph];
}

void stm32wb_system_periph_disable(uint32_t periph)
{
    __armv7m_atomic_and(stm32wb_system_xlate_ENR[periph], ~stm32wb_system_xlate_ENMSK[periph]);
    *stm32wb_system_xlate_ENR[periph];
}

void stm32wb_system_swd_enable(void)
{
    DBGMCU->CR       = DBGMCU_CR_DBG_SLEEP | DBGMCU_CR_DBG_STOP | DBGMCU_CR_DBG_STANDBY;
    DBGMCU->APB1FZR1 = (DBGMCU_APB1FZR1_DBG_RTC_STOP |
                        DBGMCU_APB1FZR1_DBG_IWDG_STOP |
                        DBGMCU_APB1FZR1_DBG_I2C1_STOP |
                        DBGMCU_APB1FZR1_DBG_I2C3_STOP |
                        DBGMCU_APB1FZR1_DBG_LPTIM1_STOP);
    DBGMCU->APB1FZR2 = (DBGMCU_APB1FZR2_DBG_LPTIM2_STOP);
    DBGMCU->APB2FZR  = 0;

    // RTT in SRAM2
    armv7m_atomic_or(&RCC->AHB3SMENR, RCC_AHB3SMENR_SRAM2SMEN);
    
#if 0        
    armv7m_atomic_or(&EXTI->IMR2, EXTI_IMR2_IM48);
    armv7m_atomic_or(&EXTI->C2IMR2, EXTI_C2IMR2_IM48);
#endif
    
    __stm32wb_gpio_swd_enable();

    stm32wb_system_reference(STM32WB_SYSTEM_REFERENCE_SWD);
}

void stm32wb_system_swd_disable(void)
{
    stm32wb_system_unreference(STM32WB_SYSTEM_REFERENCE_SWD);

    __stm32wb_gpio_swd_disable();

#if 0        
    armv7m_atomic_and(&EXTI->IMR2, ~EXTI_IMR2_IM48);
    armv7m_atomic_and(&EXTI->C2IMR2, ~EXTI_C2IMR2_IM48);
#endif
    
    // RTT in SRAM2
    armv7m_atomic_and(&RCC->AHB3SMENR, ~RCC_AHB3SMENR_SRAM2SMEN);
    
    DBGMCU->CR       = 0;
    DBGMCU->APB1FZR1 = 0;
    DBGMCU->APB1FZR2 = 0;
    DBGMCU->APB2FZR  = 0;
}

void stm32wb_system_register(stm32wb_system_notify_t *notify, stm32wb_system_callback_t callback, void *context, uint32_t mask)
{
    stm32wb_system_notify_t **pp_entry, *entry;

    for (pp_entry = &stm32wb_system_device.notify, entry = *pp_entry; entry; pp_entry = &entry->next, entry = *pp_entry)
    {
    }

    *pp_entry = notify;

    notify->next = NULL;
    notify->callback = callback;
    notify->context = context;
    notify->mask = mask;
}

void stm32wb_system_unregister(stm32wb_system_notify_t *notify)
{
    stm32wb_system_notify_t **pp_entry, *entry;

    notify->mask = 0;
    notify->callback = NULL;

    for (pp_entry = &stm32wb_system_device.notify, entry = *pp_entry; entry; pp_entry = &entry->next, entry = *pp_entry)
    {
        if (entry == notify)
        {
            *pp_entry = notify->next;
            
            notify->next = NULL;

            break;
        }
    }
}

void stm32wb_system_notify(uint32_t notify)
{
    stm32wb_system_notify_t *entry;

    for (entry = stm32wb_system_device.notify; entry; entry = entry->next)
    {
        if (entry->mask & notify)
        {
            (*entry->callback)(entry->context, entry->mask & notify);
        }
    }
}

void stm32wb_system_lock(uint32_t lock)
{
    __armv7m_atomic_incb(&stm32wb_system_device.lock[lock]);
}

void stm32wb_system_unlock(uint32_t lock)
{
    __armv7m_atomic_decb(&stm32wb_system_device.lock[lock]);
}

void stm32wb_system_reference(uint32_t reference)
{
    __armv7m_atomic_or(&stm32wb_system_device.reference, reference);
}

void stm32wb_system_unreference(uint32_t reference)
{
    __armv7m_atomic_and(&stm32wb_system_device.reference, ~reference);
}

void stm32wb_system_sleep(uint32_t policy)
{
    uint32_t primask, lpms;
    bool hsi16;

    if (!stm32wb_system_device.events)
    {
        if (policy <= STM32WB_SYSTEM_POLICY_RUN)
        {
            while (!stm32wb_system_device.events)
            {
                __NOP();
            }
        }
        else
        {
            if (policy <= STM32WB_SYSTEM_POLICY_SLEEP)
            {
                while (!stm32wb_system_device.events)
                {
                    __WFE();
                }
            }
            else
            {
                stm32wb_system_notify(STM32WB_SYSTEM_NOTIFY_STOP_PREPARE);

                while (!stm32wb_system_device.events)
                {
                    primask = __get_PRIMASK();

                    __disable_irq();

                    if (stm32wb_system_device.lock[STM32WB_SYSTEM_LOCK_SLEEP])
                    {
                        __WFI();
                    }
                    else
                    {
                        stm32wb_system_notify(STM32WB_SYSTEM_NOTIFY_STOP_ENTER);

                        if (!(SCB->ICSR & SCB_ICSR_VECTPENDING_Msk))
                        {
                            armv7m_systick_disable();

