GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_system.c
                            __stm32wb_gpio_stop_enter();

                            if (stm32wb_system_device.lock[STM32WB_SYSTEM_LOCK_STOP_0])
                            {
                                lpms = PWR_CR1_LPMS_STOP0;
                            }
                            else
                            {
                                if (stm32wb_system_device.lock[STM32WB_SYSTEM_LOCK_STOP_1] || !(stm32wb_system_device.reference & STM32WB_SYSTEM_REFERENCE_RANGE_1_2))
                                {
                                    lpms = PWR_CR1_LPMS_STOP1;
                                }
                                else
                                {
                                    lpms = PWR_CR1_LPMS_STOP2;
                                }
                            }

                            PWR->CR1 = (PWR->CR1 & ~PWR_CR1_LPMS) | lpms;

                            SCB->SCR |= SCB_SCR_SLEEPDEEP_Msk;
                                        
                            if (!(SCB->ICSR & SCB_ICSR_VECTPENDING_Msk))
                            {
                                while (!stm32wb_hsem_trylock(STM32WB_HSEM_INDEX_RCC, STM32WB_HSEM_PROCID_NONE))
                                {
                                }

                                do
                                {
                                    if (stm32wb_system_device.reference & STM32WB_SYSTEM_REFERENCE_WIRELESS)
                                    {
                                        hsi16 = !stm32wb_hsem_trylock(STM32WB_HSEM_INDEX_DEEPSLEEP, STM32WB_HSEM_PROCID_NONE);
                                    }
                                    else
                                    {
                                        hsi16 = true;
                                    }
                                        
                                    if (hsi16)
                                    {
                                        if ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_HSI)
                                        {
                                            if (!stm32wb_system_device.hsi16)
                                            {
                                                RCC->CR |= RCC_CR_HSION;
                                            
                                                while (!(RCC->CR & RCC_CR_HSIRDY))
                                                {
                                                }
                                            }
                                        
                                            RCC->CFGR = (RCC->CFGR & ~RCC_CFGR_SW) | RCC_CFGR_SW_HSI;
                                        
                                            while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_HSI)
                                            {
                                            }
                                        
                                            RCC->SMPSCR = (RCC->SMPSCR & ~RCC_SMPSCR_SMPSSEL) | RCC_SMPSCR_SMPSSEL_HSI;

                                            FLASH->ACR = FLASH->ACR & ~FLASH_ACR_LATENCY;
                                        }
                                    }

#if 0                                    
                                    if (stm32wb_system_device.msi)
                                    {
                                        RCC->CR &= ~RCC_CR_MSIPLLEN;
                                    }
#endif                                    
                                        
                                    if (lpms == PWR_CR1_LPMS_STOP0)
                                    {
                                        RCC->CR |= RCC_CR_HSIKERON;
                                            
                                        while (!(RCC->CR & RCC_CR_HSIKERDY))
                                        {
                                        }
                                    }

                                    stm32wb_hsem_unlock(STM32WB_HSEM_INDEX_RCC, STM32WB_HSEM_PROCID_NONE);

                                    __DSB();
                                    __WFI();
                                    __NOP();
                                    __NOP();
                                    __NOP();
                                    __NOP();
                                        
                                    stm32wb_hsem_unlock(STM32WB_HSEM_INDEX_DEEPSLEEP, STM32WB_HSEM_PROCID_NONE);
                                        
                                    while (!stm32wb_hsem_trylock(STM32WB_HSEM_INDEX_RCC, STM32WB_HSEM_PROCID_NONE))
                                    {
                                    }

                                    PWR->EXTSCR = PWR_EXTSCR_C1CSSF;

                                    __stm32wb_lptim_timeout_stop_leave();
                                }
                                while (!(SCB->ICSR & SCB_ICSR_VECTPENDING_Msk));

                                if (stm32wb_system_device.msi)
                                {
                                    if (!(RCC->CR & RCC_CR_MSION))
                                    {
                                        RCC->CR |= RCC_CR_MSION;
                                                
                                        while (!(RCC->CR & RCC_CR_MSIRDY))
                                        {
                                        }
                                                
                                        if (stm32wb_system_device.lseclk)
                                        {
                                            RCC->CR |= RCC_CR_MSIPLLEN;
                                        }
                                    }
                                }
                                        
                                if (stm32wb_system_device.hse)
                                {
                                    if (!(RCC->CR & RCC_CR_HSEON))
                                    {
                                        RCC->CR |= RCC_CR_HSEON;
                                                
