GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_system.c
                                        while (!(RCC->CR & RCC_CR_HSERDY))
                                        {
                                        }
                                    }
                                }

                                if (stm32wb_system_device.pllsys)
                                {
                                    RCC->CR |= RCC_CR_PLLON;
                                            
                                    while (!(RCC->CR & RCC_CR_PLLRDY))
                                    {
                                    }
                                }

                                if (stm32wb_system_device.hse)
                                {
                                    RCC->SMPSCR = (RCC->SMPSCR & ~RCC_SMPSCR_SMPSSEL) | RCC_SMPSCR_SMPSSEL_HSE;
                                }
                                else
                                {
                                    RCC->SMPSCR = (RCC->SMPSCR & ~RCC_SMPSCR_SMPSSEL) | RCC_SMPSCR_SMPSSEL_MSI;
                                }
                                        
                                RCC->EXTCFGR = (RCC->EXTCFGR & ~(RCC_EXTCFGR_C2HPRE | RCC_EXTCFGR_C2HPREF)) | stm32wb_system_device.c2hpre;
                                        
                                while ((RCC->EXTCFGR & RCC_EXTCFGR_C2HPREF) != RCC_EXTCFGR_C2HPREF)
                                {
                                }

                                FLASH->ACR = (FLASH->ACR & ~FLASH_ACR_LATENCY) | stm32wb_system_device.latency;
                                        
                                if (stm32wb_system_device.pllsys)
                                {
                                    RCC->CFGR = (RCC->CFGR & ~RCC_CFGR_SW) | RCC_CFGR_SW_PLL;
                                            
                                    while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_PLL)
                                    {
                                    }
                                }
                                else
                                {
                                    if (stm32wb_system_device.hse)
                                    {
                                        RCC->CFGR = (RCC->CFGR & ~RCC_CFGR_SW) | RCC_CFGR_SW_HSE;
                                                
                                        while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_HSE)
                                        {
                                        }
                                    }
                                    else
                                    {
                                        RCC->CFGR = (RCC->CFGR & ~RCC_CFGR_SW) | RCC_CFGR_SW_MSI;
                                                
                                        while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_MSI)
                                        {
                                        }
                                    }
                                }

                                if (lpms == PWR_CR1_LPMS_STOP0)
                                {
                                    RCC->CR &= ~RCC_CR_HSIKERON;
                                }
                                        
                                if (!stm32wb_system_device.hsi16)
                                {
                                    RCC->CR &= ~RCC_CR_HSION;
                                }
                                        
                                stm32wb_hsem_unlock(STM32WB_HSEM_INDEX_RCC, STM32WB_HSEM_PROCID_NONE);
                            }

                            SCB->SCR &= ~SCB_SCR_SLEEPDEEP_Msk;

                            __stm32wb_gpio_stop_leave();

                            armv7m_systick_enable();
                        }
                                
                        stm32wb_system_notify(STM32WB_SYSTEM_NOTIFY_STOP_LEAVE);
                    }
                              
                    __set_PRIMASK(primask);
                }
            }
        }
    }

    stm32wb_system_device.events = 0;
}

void stm32wb_system_wakeup(void)
{
    stm32wb_system_device.events = 1;
}

static __attribute__((noreturn)) void stm32wb_system_halt(uint32_t wakeup, bool shutdown)
{
    while (!stm32wb_hsem_trylock(STM32WB_HSEM_INDEX_RCC, STM32WB_HSEM_PROCID_NONE))
    {
    }

    if (!stm32wb_system_device.hsi16)
    {
        RCC->CR |= RCC_CR_HSION;
        
        while (!(RCC->CR & RCC_CR_HSIRDY))
        {
        }
    }
    
    RCC->CFGR = (RCC->CFGR & ~RCC_CFGR_SW) | RCC_CFGR_SW_HSI;
    
    while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_HSI)
    {
    }

    RCC->SMPSCR = (RCC->SMPSCR & ~RCC_SMPSCR_SMPSSEL) | RCC_SMPSCR_SMPSSEL_HSI;

    if (stm32wb_system_device.msi)
    {
        RCC->CR &= ~(RCC_CR_MSIPLLEN | RCC_CR_MSION);
    }
    
    stm32wb_hsem_unlock(STM32WB_HSEM_INDEX_RCC, STM32WB_HSEM_PROCID_NONE);

    if (shutdown)
    {
        if (stm32wb_system_device.smps)
        {
            PWR->CR5 &= ~(PWR_CR5_SMPSEN | PWR_CR5_BORHC);
        }

        PWR->CR1 = (PWR->CR1 & ~PWR_CR1_LPMS) | PWR_CR1_LPMS_SHUTDOWN;
    }
    else
    {
        PWR->CR1 = (PWR->CR1 & ~PWR_CR1_LPMS) | PWR_CR1_LPMS_STANDBY;
    }
    
    PWR->CR3 = ((PWR->CR3 & ~PWR_CR3_EWUP) |
                (((wakeup >> STM32WB_SYSTEM_WAKEUP_PIN_RISING_SHIFT) | (wakeup >> STM32WB_SYSTEM_WAKEUP_PIN_FALLING_SHIFT)) & PWR_CR3_EWUP) | PWR_CR3_EIWUL);
    PWR->CR4 = ((PWR->CR4 & ~(PWR_CR4_WP1 | PWR_CR4_WP2 | PWR_CR4_WP3 | PWR_CR4_WP4 | PWR_CR4_WP5)) |
                ((wakeup >> STM32WB_SYSTEM_WAKEUP_PIN_FALLING_SHIFT) & (PWR_CR4_WP1 | PWR_CR4_WP2 | PWR_CR4_WP3 | PWR_CR4_WP4 | PWR_CR4_WP5)));
    
    SCB->SCR |= SCB_SCR_SLEEPDEEP_Msk;
    __DSB();

    __SEV();
    __WFE();
    
    while (1)
    {
        __WFE();
    }
}

void stm32wb_system_standby(uint32_t wakeup, uint32_t timeout)
{
    uint32_t primask;

    if (!timeout)
    {
        return;
    }
    
    primask = __get_PRIMASK();
    
    __disable_irq();
    
    if (stm32wb_system_device.lock[STM32WB_SYSTEM_LOCK_SLEEP] ||
        stm32wb_system_device.lock[STM32WB_SYSTEM_LOCK_STOP_0] ||
        stm32wb_system_device.lock[STM32WB_SYSTEM_LOCK_STOP_1] ||
        stm32wb_system_device.lock[STM32WB_SYSTEM_LOCK_STOP_2])
    {
        __set_PRIMASK(primask);
                        
        return;
    }
    
    stm32wb_system_notify(STM32WB_SYSTEM_NOTIFY_STANDBY);

    stm32wb_rtc_standby_enter(timeout);

    stm32wb_system_halt(wakeup, false);
}

void stm32wb_system_shutdown(uint32_t wakeup)
{
    uint32_t primask;
    
    primask = __get_PRIMASK();
    
    __disable_irq();
    
    if (stm32wb_system_device.lock[STM32WB_SYSTEM_LOCK_SLEEP] ||
        stm32wb_system_device.lock[STM32WB_SYSTEM_LOCK_STOP_0] ||
        stm32wb_system_device.lock[STM32WB_SYSTEM_LOCK_STOP_1] ||
        stm32wb_system_device.lock[STM32WB_SYSTEM_LOCK_STOP_2] ||
        stm32wb_system_device.lock[STM32WB_SYSTEM_LOCK_STANDBY])
    {
        __set_PRIMASK(primask);
                        
        return;
    }

    stm32wb_system_notify(STM32WB_SYSTEM_NOTIFY_SHUTDOWN);

    stm32wb_rtc_reset();

    stm32wb_system_halt(wakeup, true);
}

