GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_system.c
void __attribute__((noreturn)) stm32wb_system_fatal(void)
{
    __disable_irq();

    stm32wb_system_notify(STM32WB_SYSTEM_NOTIFY_FATAL);

    if (CoreDebug->DHCSR & CoreDebug_DHCSR_C_DEBUGEN_Msk)
    {
        __BKPT();
    }

#warning Add some code to deal with what "FATAL" does. RESET ? DFU ? STANDBY ? SHUTDOWN ? Should this be an option ?
    
    RTC->BKP16R = (RTC->BKP16R & ~((STM32WB_RTC_BKP16R_FATAL | STM32WB_RTC_BKP16R_DFU) << STM32WB_RTC_BKP16R_NOT_DATA_SHIFT)) | STM32WB_RTC_BKP16R_FATAL | STM32WB_RTC_BKP16R_DFU;

    stm32wb_rtc_reset();

    NVIC_SystemReset();
    
    while (1)
    {
    }
}

void __attribute__((noreturn)) stm32wb_system_reset(void)
{
    __disable_irq();

    stm32wb_system_notify(STM32WB_SYSTEM_NOTIFY_RESET);

    stm32wb_rtc_reset();

    NVIC_SystemReset();
    
    while (1)
    {
    }
}

void __attribute__((noreturn)) stm32wb_system_dfu(void)
{
    __disable_irq();
    
    stm32wb_system_notify(STM32WB_SYSTEM_NOTIFY_DFU);

    RTC->BKP16R = (RTC->BKP16R & ~(STM32WB_RTC_BKP16R_DFU << STM32WB_RTC_BKP16R_NOT_DATA_SHIFT)) | STM32WB_RTC_BKP16R_DFU;

    stm32wb_rtc_reset();

    NVIC_SystemReset();
    
    while (1)
    {
    }
}

void PVD_PVM_IRQHandler(void)
{
    if (EXTI->PR1 & EXTI_PR1_PIF31)
    {
        EXTI->PR1 = EXTI_PR1_PIF31;

        if (stm32wb_system_device.pvm1_callback)
        {
            (*stm32wb_system_device.pvm1_callback)(stm32wb_system_device.pvm1_context);
        }
    }
}

static void __empty() { }

void __stm32wb_lptim_initialize(void) __attribute__ ((weak, alias("__empty")));

void __stm32wb_ipcc_initialize(void) __attribute__ ((weak, alias("__empty")));
void __stm32wb_flash_initialize(void) __attribute__ ((weak, alias("__empty")));
void __stm32wb_eeprom_initialize(void) __attribute__ ((weak, alias("__empty")));
void __stm32wb_random_initialize(void) __attribute__ ((weak, alias("__empty")));
void __stm32wb_usbd_initialize(void) __attribute__ ((weak, alias("__empty")));

void  __attribute__ ((weak))USBD_DCD_HSEMHandler(void)
{
}

void  __attribute__((weak)) RNG_HSEMHandler(void)
{
    USBD_DCD_HSEMHandler();
}

static __attribute__((naked)) void Default_IRQHandler(void)
{
    __asm__(
        "    cpsid    i                                        \n"
        "    mrs      r0, IPSR                                 \n" // code
        "    mov      r1, #0                                   \n" // file
        "    mov      r2, #0                                   \n" // line
        "    mov      r3, #0                                   \n" // state
        "    b        armv7m_core_fatal                        \n"
        );
}

void WWDG_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void TAMP_STAMP_LSECSS_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void RTC_WKUP_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void FLASH_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void RCC_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void EXTI0_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void EXTI1_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void EXTI2_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void EXTI3_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void EXTI4_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void DMA1_Channel1_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void DMA1_Channel2_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void DMA1_Channel3_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void DMA1_Channel4_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void DMA1_Channel5_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void DMA1_Channel6_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void DMA1_Channel7_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void ADC1_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void USB_HP_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void USB_LP_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void C2SEV_PWR_C2H_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void COMP_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void EXTI9_5_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void TIM1_BRK_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void TIM1_UP_TIM16_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void TIM1_TRG_COM_TIM17_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void TIM1_CC_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void TIM2_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void PKA_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void I2C1_EV_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void I2C1_ER_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void I2C3_EV_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void I2C3_ER_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void SPI1_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void SPI2_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void USART1_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void LPUART1_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void SAI1_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void TSC_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void EXTI15_10_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void RTC_Alarm_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void CRS_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void PWR_SOTF_BLEACT_802ACT_RFPHASE_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void IPCC_C1_RX_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void IPCC_C1_TX_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void HSEM_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void LPTIM1_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void LPTIM2_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void LCD_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void QUADSPI_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void AES1_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void AES2_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void RNG_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void FPU_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void DMA2_Channel1_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void DMA2_Channel2_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void DMA2_Channel3_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void DMA2_Channel4_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void DMA2_Channel5_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void DMA2_Channel6_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void DMA2_Channel7_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
void DMAMUX1_OVR_IRQHandler(void) __attribute__ ((weak, alias("Default_IRQHandler")));
